MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_cordic.c
/**
  ******************************************************************************
  * @file    stm32c5xx_hal_cordic.c
  * @brief   CORDIC HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the CORDIC peripheral:
  *           + Initialization and de-initialization functions
  *           + Peripheral Control functions
  *           + Callback functions
  *           + IRQ handler management
  *           + Peripheral state and error
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32_hal.h"

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */
#if defined(CORDIC)
#if defined(USE_HAL_CORDIC_MODULE) && (USE_HAL_CORDIC_MODULE == 1)

/** @addtogroup CORDIC
  * @{
  */
/** @defgroup CORDIC_Introduction CORDIC Introduction
  * @{

  - The Hardware Abstraction Layer CORDIC provides an efficient interface to the hardware CORDIC coprocessor,
    which accelerates mathematical functions commonly used in motor control, metering, signal processing, and other
    embedded applications.

  - It supports a variety of functions including sine, cosine, hyperbolic sine and cosine, arctangent, modulus,
    square root, and natural logarithm, enabling flexible use across different computational needs.

  - The CORDIC HAL allows configurable precision, scaling factors, and flexible settings for the number and width
    of input arguments and output results to optimize performance and data handling.

  - The HAL CORDIC provides calculation modes including polling, zero-overhead, interrupt, and DMA to accommodate
    different application requirements.

  - These features simplify the integration of complex mathematical calculations in embedded systems, improving
    performance and offloading the processor to handle other processes.

  */
/**
  * @}
  */

/** @defgroup CORDIC_How_To_Use CORDIC How To Use
  * @{

# How to use the CORDIC HAL module driver

1. Declare a hal_cordic_handle_t handle structure and initialize the CORDIC driver with a CORDIC instance using
   HAL_CORDIC_Init().
   HAL_CORDIC_Init() enables the CORDIC clock when USE_HAL_CORDIC_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO.
2. Configure the low-level hardware (CLOCK, NVIC, DMA...):
  - Enable the CORDICx interface clock unless you have set USE_HAL_CORDIC_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO; in this
    case, HAL_CORDIC_Init() enables the clock.
  - NVIC configuration if you need to use interrupt processing:
    - Configure the CORDIC interrupt priority using HAL_CORTEX_NVIC_SetPriority().
    - Enable the CORDIC IRQ handler using HAL_CORTEX_NVIC_EnableIRQ().
    - In the CORDIC IRQ handler, call HAL_CORDIC_IRQHandler().
  - DMA configuration if you need to use DMA processing:
    - Enable the DMAx interface clock.
    - Configure and enable two DMA channels, one for managing data transfer from memory to peripheral (input channel)
      and another channel for managing data transfer from peripheral to memory (output channel).
    - Associate the initialized DMA handle to the CORDIC DMA handle.
    - Configure the priority and enable the NVIC for the transfer complete interrupt on the two DMA channels by calling
      the HAL_CORTEX_NVIC_SetPriority() and HAL_CORTEX_NVIC_EnableIRQ() functions.

3. Configure the minimum configuration needed for the CORDIC driver by calling HAL_CORDIC_SetConfig().
  - This function configures:
    - Processing functions: Cosine, Sine, Phase, Modulus, Arctangent, Hyperbolic cosine, Hyperbolic sine,
      Hyperbolic arctangent, Natural log, Square root.
    - Scaling factor: 1 to 2exp(-7).
    - Width of input data: 32-bit input data width (Q1.31 format) or 16-bit input data width (Q1.15 format).
    - Width of output data: 32-bit output data width (Q1.31 format) or 16-bit output data width (Q1.15 format).
    - Number of 32-bit writes expected for one calculation: One 32-bit write or two 32-bit writes.
    - Number of 32-bit reads expected after one calculation: One 32-bit read or two 32-bit reads.
    - Precision: 1 to 15 cycles for calculation (the more cycles, the better precision).

4. Operation modes:
  - Polling mode operations:

    - The processing API is a blocking function, that is, it processes the data and waits until the output results are
      available.
      Perform this operation by calling HAL_CORDIC_Calculate().

  - Zero-overhead mode operations:

    - The processing API is a blocking function, that is, it writes data to process and reads the result immediately.
      Any attempt to read the result inserts a bus wait state until the
      calculation is completed. Perform this operation by calling HAL_CORDIC_CalculateZeroOverhead().

  - Interrupt mode operations:

    - The processing API is a non-blocking function, and an interrupt is generated whenever the output results are
      available. The result of the calculation is read in the interrupt service routine. However, it is slower than
      directly reading the result or polling the flag because of interrupt handling delays. Perform this operation by
      calling HAL_CORDIC_Calculate_IT().
    - When all the computations are done, HAL_CORDIC_CalculateCpltCallback() is executed. This callback is a weak
      function and can be overridden by the user or by registering a callback function.
    - In case of error during computation, the HAL_CORDIC_ErrorCallback() callback is executed. This callback is a weak
      function and can be overridden by the user or by registering a callback function.

  - DMA mode operations:

    - The processing API is a non-blocking function and allows offloading the CPU. If both channels are enabled,
      the CORDIC can autonomously perform repeated calculations on a buffer of data without any CPU access.
      Perform this operation by calling HAL_CORDIC_Calculate_DMA(). This function operates with
      a DMA channel In and a DMA channel out only.
    - The current DMA transfer can be cancelled using the HAL_CORDIC_Abort() or HAL_CORDIC_Abort_IT() functions.
    - When half of all the data are written, HAL_CORDIC_WriteHalfCpltCallback() is executed. This callback is a weak
      function and can be overridden by the user or by registering a callback function.
    - When half of all the results are read, HAL_CORDIC_ReadHalfCpltCallback() is executed. This callback
      is a weak function and can be overridden by the user or by registering a callback function.
    - When all the computations are done, HAL_CORDIC_CalculateCpltCallback() is executed. This callback is a weak
      function and can be overridden by the user or by registering a callback function.
    - In case of error during computation, the HAL_CORDIC_ErrorCallback() callback is executed. This callback is a weak
      function and can be overridden by the user or by registering a callback function.

5. Write and read operations directly driven by another peripheral (Timer, ADC, DAC, etc) are available through:
    - Use the HAL_CORDIC_GetWriteAddress() and HAL_CORDIC_GetReadAddress() functions to get the addresses of the
      arguments and results as required by the user application.
    - Use HAL_CORDIC_Write_DMA() to manage the DMA write stream to the CORDIC peripheral, while the CORDIC customer
      peripheral (Timer, ADC, DAC, etc) is responsible for managing the corresponding DMA read stream through its
      dedicated DMA channel.
    - Use HAL_CORDIC_Read_DMA() to manage the DMA read stream to the CORDIC peripheral, while the CORDIC customer
      peripheral (Timer, ADC, DAC, etc) is responsible for managing the corresponding DMA write stream through its
      dedicated DMA channel.

6. Call HAL_CORDIC_DeInit() to deinitialize the CORDIC peripheral.

