MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_cordic.c
7. Call HAL_CORDIC_GetInstance() or HAL_CORDIC_GetLLInstance() to retrieve the CORDIC instance.

8. Callback definition in Interrupt or DMA mode:

  When the preprocessor directive USE_HAL_CORDIC_REGISTER_CALLBACKS is set to 1, the user can dynamically configure the
  driver callbacks using their own method:

Callback name               | Default value                      | Callback registration function
----------------------------| -----------------------------------| --------------------------------------------
ErrorCallback               | HAL_CORDIC_ErrorCallback           | HAL_CORDIC_RegisterErrorCallback()
CalculationCpltCallback     | HAL_CORDIC_CalculateCpltCallback   | HAL_CORDIC_RegisterCalculateCpltCallback()
WriteDataCpltCallback       | HAL_CORDIC_WriteCpltCallback       | HAL_CORDIC_RegisterWriteCpltCallback()
AbortCpltCallback           | HAL_CORDIC_AbortCpltCallback       | HAL_CORDIC_RegisterAbortCpltCallback()
WriteHalfCpltCallback       | HAL_CORDIC_WriteHalfCpltCallback   | HAL_CORDIC_RegisterWriteHalfCpltCallback()
ReadHalfCpltCallback        | HAL_CORDIC_ReadHalfCpltCallback    | HAL_CORDIC_RegisterReadHalfCpltCallback()

  To unregister a callback, register the default callback.

  By default, after HAL_CORDIC_Init(), and when the state is \ref HAL_CORDIC_STATE_INIT, all callbacks are set to
  the corresponding weak functions.

  Callbacks can be registered in HAL_CORDIC_STATE_INIT or HAL_CORDIC_STATE_IDLE states only.

  When the preprocessor directive USE_HAL_CORDIC_REGISTER_CALLBACKS is set to 0 or undefined, the callback registration
  feature is not available and all callbacks are set to the corresponding weak functions.
  */
/**
  * @}
  */

/** @defgroup CORDIC_Configuration_Table CORDIC Configuration Table
  * @{

# Configuration inside the CORDIC driver

Software configuration defined in stm32c5xx_hal_conf.h:
preprocessor flags                |   Default value   | Comment
--------------------------------- | ----------------- | ------------------------------------------------
USE_HAL_CORDIC_MODULE             |         1         | Enable HAL CORDIC driver module
USE_HAL_CORDIC_REGISTER_CALLBACKS |         0         | Allow the user to define their own callback
USE_HAL_CORDIC_DMA                |         1         | Enable DMA code inside CORDIC
USE_HAL_CHECK_PARAM               |         0         | Enable runtime parameter check
USE_HAL_CORDIC_CLK_ENABLE_MODEL   | HAL_CLK_ENABLE_NO | Enable the gating of the peripheral clock
USE_HAL_CHECK_PROCESS_STATE       |         0         | Enable atomicity of process state check
USE_HAL_CORDIC_USER_DATA          |         0         | Add a user data inside HAL CORDIC handle
USE_HAL_CORDIC_GET_LAST_ERRORS    |         0         | Enable retrieval of last processes error codes

Software configuration defined in preprocessor environment:
preprocessor flags                |   Default value   | Comment
--------------------------------- | ----------------- | ------------------------------------------------
USE_ASSERT_DBG_PARAM              |    Not defined    | Enable check param for HAL and LL
USE_ASSERT_DBG_STATE              |    Not defined    | Enable check state for HAL

  */
/**
  * @}
  */

/* Private constants ---------------------------------------------------------*/
/** @defgroup CORDIC_Private_Constants CORDIC Private Constants
  * @{
  */
#define CORDIC_ARGUMENT1              0UL                       /*!< Default argument 1             */
#define CORDIC_ARGUMENT2              0x7FFFFFFFUL              /*!< Default argument 2             */
#define CORDIC_FLAG_NOT_ACTIVE        0UL                       /*!< Flag not active                */
/**
  * @}
  */
/* Private macros -------------------------------------------------------------*/
/** @defgroup CORDIC_Private_Macros CORDIC Private Macros
  * @{
  */
/**
  * @brief Retrieve the CORDIC HW cmsis instance from the hal handle.
  */
#define CORDIC_GET_INSTANCE(handle) \
  ((CORDIC_TypeDef *)((uint32_t)((handle)->instance)))

/**
  * @brief Verify the CORDIC function.
  * @param  function function.
  * @retval SET   function is valid.
  * @retval RESET function is invalid.
  */
#define IS_CORDIC_FUNCTION(function) (((function) == HAL_CORDIC_FUNCTION_COSINE)          \
                                      || ((function) == HAL_CORDIC_FUNCTION_SINE)         \
                                      || ((function) == HAL_CORDIC_FUNCTION_PHASE)        \
                                      || ((function) == HAL_CORDIC_FUNCTION_MODULUS)      \
                                      || ((function) == HAL_CORDIC_FUNCTION_ARCTANGENT)   \
                                      || ((function) == HAL_CORDIC_FUNCTION_HCOSINE)      \
                                      || ((function) == HAL_CORDIC_FUNCTION_HSINE)        \
                                      || ((function) == HAL_CORDIC_FUNCTION_HARCTANGENT)  \
                                      || ((function) == HAL_CORDIC_FUNCTION_NATURAL_LOG)  \
                                      || ((function) == HAL_CORDIC_FUNCTION_SQUARE_ROOT))

/**
  * @brief Verify the CORDIC precision.
  * @param  precision precision value.
  * @retval SET   precision is valid.
  * @retval RESET precision is invalid.
  */
#define IS_CORDIC_PRECISION(precision) (((precision) == HAL_CORDIC_PRECISION_1_CYCLE)      \
                                        || ((precision) == HAL_CORDIC_PRECISION_2_CYCLE)  \
                                        || ((precision) == HAL_CORDIC_PRECISION_3_CYCLE)  \
                                        || ((precision) == HAL_CORDIC_PRECISION_4_CYCLE)  \
                                        || ((precision) == HAL_CORDIC_PRECISION_5_CYCLE)  \
                                        || ((precision) == HAL_CORDIC_PRECISION_6_CYCLE)  \
                                        || ((precision) == HAL_CORDIC_PRECISION_7_CYCLE)  \
                                        || ((precision) == HAL_CORDIC_PRECISION_8_CYCLE)  \
                                        || ((precision) == HAL_CORDIC_PRECISION_9_CYCLE)  \
                                        || ((precision) == HAL_CORDIC_PRECISION_10_CYCLE) \
                                        || ((precision) == HAL_CORDIC_PRECISION_11_CYCLE) \
                                        || ((precision) == HAL_CORDIC_PRECISION_12_CYCLE) \
                                        || ((precision) == HAL_CORDIC_PRECISION_13_CYCLE) \
                                        || ((precision) == HAL_CORDIC_PRECISION_14_CYCLE) \
                                        || ((precision) == HAL_CORDIC_PRECISION_15_CYCLE))

/**
  * @brief Verify the CORDIC scaling factor.
  * @param  scaling_factor scaling factor value.
  * @retval SET   scaling_factor is valid.
  * @retval RESET scaling_factor is invalid.
  */
#define IS_CORDIC_SCALING(scaling_factor) (((scaling_factor) == HAL_CORDIC_SCALING_FACTOR_0)     \
                                           || ((scaling_factor) == HAL_CORDIC_SCALING_FACTOR_1)  \
                                           || ((scaling_factor) == HAL_CORDIC_SCALING_FACTOR_2)  \
                                           || ((scaling_factor) == HAL_CORDIC_SCALING_FACTOR_3)  \
                                           || ((scaling_factor) == HAL_CORDIC_SCALING_FACTOR_4)  \
                                           || ((scaling_factor) == HAL_CORDIC_SCALING_FACTOR_5)  \
                                           || ((scaling_factor) == HAL_CORDIC_SCALING_FACTOR_6)  \
                                           || ((scaling_factor) == HAL_CORDIC_SCALING_FACTOR_7))

/**
  * @brief Verify the CORDIC number of 32-bit arguments expected for one calculation.
  * @param  nbargs number of 32-bit arguments.
  * @retval SET   nbargs is valid.
  * @retval RESET nbargs is invalid.
  */
#define IS_CORDIC_NBARGS(nbargs) (((nbargs) == HAL_CORDIC_NB_ARG_1) \
                                  || ((nbargs) == HAL_CORDIC_NB_ARG_2))

/**
  * @brief Verify the CORDIC number of 32-bit results expected after one calculation.
  * @param  result_nb number of 32-bit results.
  * @retval SET   result_nb is valid.
  * @retval RESET result_nb is invalid.
  */
#define IS_CORDIC_RESULT_NB(result_nb) (((result_nb) == HAL_CORDIC_NB_RESULT_1) \
                                        || ((result_nb) == HAL_CORDIC_NB_RESULT_2))

/**
  * @brief Verify the CORDIC input data width for one calculation.
  * @param  in_width input data width.
  * @retval SET   in_width is valid.
  * @retval RESET in_width is invalid.
  */
#define IS_CORDIC_IN_WIDTH(in_width) (((in_width) == HAL_CORDIC_IN_WIDTH_32_BIT) \
                                      || ((in_width) == HAL_CORDIC_IN_WIDTH_16_BIT))

/**
  * @brief Verify the CORDIC output data width for one calculation.
  * @param  out_width output data width.
  * @retval SET   out_width is valid.
  * @retval RESET out_width is invalid.
  */
#define IS_CORDIC_OUT_WIDTH(out_width) (((out_width) == HAL_CORDIC_OUT_WIDTH_32_BIT) \
                                        || ((out_width) == HAL_CORDIC_OUT_WIDTH_16_BIT))

/**
  * @brief Verify write input DMA optional interrupt.
  * @param  it Interrupt selection
  * @retval SET   it is valid
  * @retval RESET it is invalid
  */
#define IS_CORDIC_OPT_DMA_IT_WR(it) (((it) == HAL_CORDIC_OPT_DMA_NONE)\
                                     || ((it) == HAL_CORDIC_OPT_DMA_IT_HALF_CPLT))

/**
  * @brief Verify  read result DMA optional interrupt.
  * @param  it Interrupt selection.
  * @retval SET   it is valid.
  * @retval RESET it is invalid.
  */
#define IS_CORDIC_OPT_DMA_IT_RD(it) (((it) == HAL_CORDIC_OPT_DMA_NONE)\
                                     || ((it) == HAL_CORDIC_OPT_DMA_IT_HALF_CPLT))


/**
  * @}
  */

