MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_cordic.c
/* Private function prototypes -----------------------------------------------*/
/** @defgroup CORDIC_Private_Functions CORDIC Private Functions
  * @{
  */
static inline void CORDIC_ResetArguments(const hal_cordic_handle_t *hcordic);
#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
static inline uint32_t CORDIC_CheckPrecision(hal_cordic_function_t function, hal_cordic_precision_t precision);
static inline uint32_t CORDIC_CheckScalingFactor(hal_cordic_function_t function,
                                                 hal_cordic_scaling_factor_t scaling_factor);
#endif /* USE_HAL_CHECK_PARAM */
static uint32_t CORDIC_ValidateWriteNumber(const hal_cordic_handle_t *hcordic,
                                           const hal_cordic_buffer_desc_t *p_input_buffer_desc);
static uint32_t CORDIC_ValidateReadNumber(const hal_cordic_handle_t *hcordic,
                                          const hal_cordic_buffer_desc_t *p_output_buffer_desc);
static void CORDIC_WriteDataAndIncPtr_1(const hal_cordic_handle_t *hcordic, const int32_t **pp_input_buffer);
static void CORDIC_WriteDataAndIncPtr_2(const hal_cordic_handle_t *hcordic, const int32_t **pp_input_buffer);
static void CORDIC_ReadDataAndIncPtr_1(const hal_cordic_handle_t *hcordic, int32_t **pp_output_buffer);
static void CORDIC_ReadDataAndIncPtr_2(const hal_cordic_handle_t *hcordic, int32_t **pp_output_buffer);
static hal_status_t CORDIC_Abort(hal_cordic_handle_t *hcordic);
#if defined(USE_HAL_CORDIC_DMA) && (USE_HAL_CORDIC_DMA == 1)
static void CORDIC_DMAAbort(hal_dma_handle_t *hdma);
static hal_status_t CORDIC_Write_DMA_opt(hal_cordic_handle_t *hcordic, const hal_cordic_buffer_desc_t *p_in_buff,
                                         uint32_t opt_it);
static hal_status_t CORDIC_Read_DMA_opt(hal_cordic_handle_t *hcordic, hal_cordic_buffer_desc_t *p_out_buff,
                                        uint32_t opt_it);
static void CORDIC_DMAInCplt(hal_dma_handle_t *hdma);
static void CORDIC_DMAInHalfCplt(hal_dma_handle_t *hdma);
static void CORDIC_DMAOutCplt(hal_dma_handle_t *hdma);
static void CORDIC_DMAOutHalfCplt(hal_dma_handle_t *hdma);
static void CORDIC_DMAError(hal_dma_handle_t *hdma);
#endif /* USE_HAL_CORDIC_DMA */
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup CORDIC_Exported_Functions
  * @{
  */

/** @addtogroup CORDIC_Exported_Functions_Group1
  * @{

This section provides a set of functions to initialize and deinitialize the CORDIC peripheral:

- Call the function HAL_CORDIC_Init() to initialize the selected CORDIC handle.
- Call the function HAL_CORDIC_DeInit() to deinitialize the selected CORDIC handle.
  */

/**
  * @brief Initialize the HAL CORDIC handle and associate it to an instance of the CORDIC peripheral.
  * @param  hcordic  Pointer to a \ref hal_cordic_handle_t.
  * @param  instance CORDIC instance.
  * @retval HAL_OK              CORDIC instance has been correctly initialized.
  * @retval HAL_INVALID_PARAM   Pointer to HAL CORDIC handle is NULL.
  */
hal_status_t HAL_CORDIC_Init(hal_cordic_handle_t *hcordic, hal_cordic_t instance)
{
  ASSERT_DBG_PARAM((hcordic != NULL));
  ASSERT_DBG_PARAM(IS_CORDIC_ALL_INSTANCE((CORDIC_TypeDef *)((uint32_t)instance)));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hcordic == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hcordic->instance = instance;

#if defined (USE_HAL_CORDIC_DMA) && (USE_HAL_CORDIC_DMA == 1)
  hcordic->p_dma_in  = NULL;
  hcordic->p_dma_out = NULL;
#endif /* USE_HAL_CORDIC_DMA */

#if defined (USE_HAL_CORDIC_USER_DATA) && (USE_HAL_CORDIC_USER_DATA == 1)
  hcordic->p_user_data = (void *) NULL;
#endif /* USE_HAL_CORDIC_USER_DATA */

#if defined(USE_HAL_CORDIC_REGISTER_CALLBACKS) && (USE_HAL_CORDIC_REGISTER_CALLBACKS == 1)
  if (hcordic->global_state == HAL_CORDIC_STATE_RESET)
  {
    /* Register the weak functions as default callback functions */
    hcordic->p_error_cb           = HAL_CORDIC_ErrorCallback;
    hcordic->p_calculate_cplt_cb  = HAL_CORDIC_CalculateCpltCallback;
    hcordic->p_write_cplt_cb      = HAL_CORDIC_WriteCpltCallback;
    hcordic->p_abort_cplt_cb      = HAL_CORDIC_AbortCpltCallback;
#if defined (USE_HAL_CORDIC_DMA) && (USE_HAL_CORDIC_DMA == 1)
    hcordic->p_read_half_cplt_cb  = HAL_CORDIC_ReadHalfCpltCallback;
    hcordic->p_write_half_cplt_cb = HAL_CORDIC_WriteHalfCpltCallback;
#endif /* USE_HAL_CORDIC_DMA */
  }
#endif /* USE_HAL_CORDIC_REGISTER_CALLBACKS */

#if defined(USE_HAL_CORDIC_GET_LAST_ERRORS) && (USE_HAL_CORDIC_GET_LAST_ERRORS == 1)
  hcordic->last_error_codes = HAL_CORDIC_ERROR_NONE;
#endif /* USE_HAL_CORDIC_GET_LAST_ERRORS */

  hcordic->p_input_buffer  = NULL;
  hcordic->p_output_buffer = NULL;

  hcordic->computation_nb = 0UL;
  hcordic->result_nb      = 0UL;

  hcordic->p_wr_arg        = NULL;
  hcordic->p_rd_result     = NULL;

#if defined(USE_HAL_CORDIC_CLK_ENABLE_MODEL) && (USE_HAL_CORDIC_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO)
  HAL_RCC_CORDIC_EnableClock();
#endif /* USE_HAL_CORDIC_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO */

  hcordic->global_state = HAL_CORDIC_STATE_INIT;

  return HAL_OK;
}

/**
  * @brief DeInitialize the CORDIC peripheral.
  * @param  hcordic Pointer to a \ref hal_cordic_handle_t.
  */
void HAL_CORDIC_DeInit(hal_cordic_handle_t *hcordic)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM((hcordic != NULL));
  ASSERT_DBG_PARAM(IS_CORDIC_ALL_INSTANCE((CORDIC_TypeDef *)((uint32_t)hcordic->instance)));

  const hal_cordic_state_t temp_state = hcordic->global_state;
  if ((temp_state == HAL_CORDIC_STATE_IDLE) || (temp_state == HAL_CORDIC_STATE_ACTIVE))
  {
    (void)CORDIC_Abort(hcordic);
  }

  hcordic->global_state = HAL_CORDIC_STATE_RESET;
}

/**
  * @}
  */

/** @addtogroup CORDIC_Exported_Functions_Group2
  * @{

This section provides a set of functions to configure the CORDIC driver:

- Call the function HAL_CORDIC_SetConfig() to configure the peripheral before starting the CORDIC driver.
- Call the function HAL_CORDIC_GetConfig() to retrieve the configuration.
- Call the function HAL_CORDIC_SetFunction() to set the mathematical function.
- Call the function HAL_CORDIC_GetFunction() to retrieve the current mathematical function.
- Call the function HAL_CORDIC_SetInputWidth() to set the width (16-bit or 32-bit) of the input data.
- Call the function HAL_CORDIC_GetInputWidth() to retrieve the current width of the input data.
- Call the function HAL_CORDIC_SetOutputWidth() to set the width (16-bit or 32-bit) of the output data.
- Call the function HAL_CORDIC_GetOutputWidth() to retrieve the current width of the output data.
- Call the function HAL_CORDIC_SetNumberArguments() to set the number of arguments of the function.
- Call the function HAL_CORDIC_GetNumberArguments() to retrieve the current number of arguments of the function.
- Call the function HAL_CORDIC_SetNumberResults() to set the number of results of the function.
- Call the function HAL_CORDIC_GetNumberResults() to retrieve the current number of results.
- Call the function HAL_CORDIC_SetPrecision() to set the precision required.
- Call the function HAL_CORDIC_GetPrecision() to retrieve the current precision.
- Call the function HAL_CORDIC_SetScalingFactor() to set the scaling factor.
- Call the function HAL_CORDIC_GetScalingFactor() to retrieve the current scaling factor.
- Call the function HAL_CORDIC_SetWriteDMA() to set the DMA channel for writing arguments.
- Call the function HAL_CORDIC_SetReadDMA() to set the DMA channel for reading results.
- Call the function HAL_CORDIC_GetWriteAddress() to get the address of the input arguments.
- Call the function HAL_CORDIC_GetReadAddress() to get the address of the output results.
  */

/**
  * @brief Configure the CORDIC driver.
  * @param  hcordic  Pointer to a \ref hal_cordic_handle_t.
  * @param  p_config Pointer to a \ref hal_cordic_config_t structure.
  * @retval HAL_OK              CORDIC block has been correctly configured.
  * @retval HAL_INVALID_PARAM   When the p_config pointer is NULL.
  */
hal_status_t HAL_CORDIC_SetConfig(hal_cordic_handle_t *hcordic, const hal_cordic_config_t *p_config)
{
  CORDIC_TypeDef *p_cordic;

  ASSERT_DBG_PARAM((hcordic != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));
  ASSERT_DBG_PARAM(IS_CORDIC_FUNCTION(p_config->function));
  ASSERT_DBG_PARAM(IS_CORDIC_PRECISION(p_config->precision));
  ASSERT_DBG_PARAM(IS_CORDIC_SCALING(p_config->scaling_factor));
  ASSERT_DBG_PARAM(IS_CORDIC_NBARGS(p_config->nb_arg));
  ASSERT_DBG_PARAM(IS_CORDIC_RESULT_NB(p_config->nb_result));
  ASSERT_DBG_PARAM(IS_CORDIC_IN_WIDTH(p_config->in_width));
  ASSERT_DBG_PARAM(IS_CORDIC_OUT_WIDTH(p_config->out_width));
  ASSERT_DBG_STATE(hcordic->global_state, (uint32_t)(HAL_CORDIC_STATE_INIT | HAL_CORDIC_STATE_IDLE));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }

  if (CORDIC_CheckScalingFactor(p_config->function, p_config->scaling_factor) == 0UL)
  {
    return HAL_INVALID_PARAM;
  }

  if (CORDIC_CheckPrecision(p_config->function, p_config->precision) == 0UL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

