MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_cordic.c
  p_cordic = CORDIC_GET_INSTANCE(hcordic);

  /* Apply all configuration parameters in CORDIC control register */
  LL_CORDIC_Config(p_cordic, (uint32_t)(p_config->function), (uint32_t)(p_config->precision),
                   (uint32_t)(p_config->scaling_factor), (uint32_t)(p_config->nb_arg),
                   (uint32_t)(p_config->nb_result), (uint32_t)(p_config->in_width),
                   (uint32_t)(p_config->out_width));

  hcordic->global_state = HAL_CORDIC_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief Retrieve the CORDIC global configuration.
  * @param  hcordic Pointer to a \ref hal_cordic_handle_t.
  * @param  p_config pointer to \ref hal_cordic_config_t structure.
  */
void HAL_CORDIC_GetConfig(const hal_cordic_handle_t *hcordic, hal_cordic_config_t *p_config)
{
  CORDIC_TypeDef *p_cordic;

  ASSERT_DBG_PARAM((hcordic != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));
  ASSERT_DBG_STATE(hcordic->global_state, (uint32_t)(HAL_CORDIC_STATE_IDLE | HAL_CORDIC_STATE_ACTIVE
                                                     | HAL_CORDIC_STATE_ABORT));

  p_cordic = CORDIC_GET_INSTANCE(hcordic);

  p_config->function = (hal_cordic_function_t)LL_CORDIC_GetFunction(p_cordic);
  p_config->scaling_factor = (hal_cordic_scaling_factor_t)LL_CORDIC_GetScale(p_cordic);
  p_config->in_width = (hal_cordic_in_width_t)LL_CORDIC_GetInWidth(p_cordic);
  p_config->out_width = (hal_cordic_out_width_t)LL_CORDIC_GetOutWidth(p_cordic);
  p_config->precision = (hal_cordic_precision_t)LL_CORDIC_GetPrecision(p_cordic);
  p_config->nb_arg = (hal_cordic_nb_arg_t)LL_CORDIC_GetNbWrite(p_cordic);
  p_config->nb_result  = (hal_cordic_nb_result_t)LL_CORDIC_GetNbRead(p_cordic);
}

/**
  * @brief Set the CORDIC function.
  * @param  hcordic Pointer to a \ref hal_cordic_handle_t.
  * @param  function  The value can be value of \ref hal_cordic_function_t.
  * @retval HAL_OK    CORDIC function was successfully set.
  */
hal_status_t HAL_CORDIC_SetFunction(hal_cordic_handle_t *hcordic, hal_cordic_function_t function)
{
  CORDIC_TypeDef *p_cordic;

  ASSERT_DBG_PARAM((hcordic != NULL));
  ASSERT_DBG_PARAM(IS_CORDIC_FUNCTION(function));
  ASSERT_DBG_STATE(hcordic->global_state, (uint32_t)HAL_CORDIC_STATE_IDLE);

  /* Flush the argument register when calculation is over */
  CORDIC_ResetArguments(hcordic);

  p_cordic = CORDIC_GET_INSTANCE(hcordic);

  LL_CORDIC_SetFunction(p_cordic, (uint32_t)function);

  return HAL_OK;
}

/**
  * @brief Retrieve the current CORDIC function.
  * @param  hcordic Pointer to a \ref hal_cordic_handle_t structure.
  * @retval hal_cordic_function_t CORDIC function.
  */
hal_cordic_function_t HAL_CORDIC_GetFunction(const hal_cordic_handle_t *hcordic)
{
  CORDIC_TypeDef *p_cordic;

  ASSERT_DBG_PARAM((hcordic != NULL));
  ASSERT_DBG_STATE(hcordic->global_state, (uint32_t)(HAL_CORDIC_STATE_IDLE | HAL_CORDIC_STATE_ACTIVE
                                                     | HAL_CORDIC_STATE_ABORT));

  p_cordic = CORDIC_GET_INSTANCE(hcordic);

  return ((hal_cordic_function_t)LL_CORDIC_GetFunction(p_cordic));
}

/**
  * @brief Set the CORDIC precision in multiple of 4 cycles number.
  * @param  hcordic Pointer to a \ref hal_cordic_handle_t.
  * @param  precision The value can be a value of \ref hal_cordic_precision_t.
  * @retval HAL_OK      CORDIC precision was successfully configured.
  * @retval HAL_INVALID_PARAM The precision does not match the function requirements.
  */
hal_status_t HAL_CORDIC_SetPrecision(const hal_cordic_handle_t *hcordic, const hal_cordic_precision_t precision)
{
  CORDIC_TypeDef *p_cordic;

  ASSERT_DBG_PARAM((hcordic != NULL));
  ASSERT_DBG_PARAM(IS_CORDIC_PRECISION(precision));
  ASSERT_DBG_STATE(hcordic->global_state, (uint32_t)HAL_CORDIC_STATE_IDLE);

  p_cordic = CORDIC_GET_INSTANCE(hcordic);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  hal_cordic_function_t function = (hal_cordic_function_t)LL_CORDIC_GetFunction(p_cordic);

  /* Check coherency of the precision vs function already set */
  if (CORDIC_CheckPrecision(function, precision) == 0UL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  LL_CORDIC_SetPrecision(p_cordic, (uint32_t)precision);

  return HAL_OK;
}

/**
  * @brief Retrieve the CORDIC precision.
  * @param  hcordic Pointer to a \ref hal_cordic_handle_t.
  * @retval hal_cordic_precision_t CORDIC precision.
  */
hal_cordic_precision_t HAL_CORDIC_GetPrecision(const hal_cordic_handle_t *hcordic)
{
  CORDIC_TypeDef *p_cordic;

  ASSERT_DBG_PARAM((hcordic != NULL));
  ASSERT_DBG_STATE(hcordic->global_state, (uint32_t)(HAL_CORDIC_STATE_IDLE | HAL_CORDIC_STATE_ACTIVE
                                                     | HAL_CORDIC_STATE_ABORT));

  p_cordic = CORDIC_GET_INSTANCE(hcordic);

  return ((hal_cordic_precision_t)LL_CORDIC_GetPrecision(p_cordic));
}

/**
  * @brief Set the CORDIC scaling factor.
  * @param  hcordic Pointer to a \ref hal_cordic_handle_t.
  * @param  scaling_factor The value can be a value of \ref hal_cordic_scaling_factor_t.
  * @retval HAL_OK  CORDIC scaling factor was successfully configured.
  * @retval HAL_INVALID_PARAM The scaling_factor does not match the function requirements.
  */
hal_status_t HAL_CORDIC_SetScalingFactor(const hal_cordic_handle_t *hcordic,
                                         const hal_cordic_scaling_factor_t scaling_factor)
{
  CORDIC_TypeDef *p_cordic;

  ASSERT_DBG_PARAM((hcordic != NULL));
  ASSERT_DBG_PARAM(IS_CORDIC_SCALING(scaling_factor));
  ASSERT_DBG_STATE(hcordic->global_state, (uint32_t)HAL_CORDIC_STATE_IDLE);

  p_cordic = CORDIC_GET_INSTANCE(hcordic);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  hal_cordic_function_t function = (hal_cordic_function_t)LL_CORDIC_GetFunction(p_cordic);

  /* Check coherency of the scaling factor vs function already set */
  if (CORDIC_CheckScalingFactor(function, scaling_factor) == 0UL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  LL_CORDIC_SetScale(p_cordic, (uint32_t)scaling_factor);

  return HAL_OK;
}

/**
  * @brief Retrieve the CORDIC scaling factor.
  * @param  hcordic Pointer to a \ref hal_cordic_handle_t.
  * @retval hal_cordic_scaling_factor_t CORDIC scaling factor.
  */
hal_cordic_scaling_factor_t HAL_CORDIC_GetScalingFactor(const hal_cordic_handle_t *hcordic)
{
  CORDIC_TypeDef *p_cordic;

  ASSERT_DBG_PARAM((hcordic != NULL));
  ASSERT_DBG_STATE(hcordic->global_state, (uint32_t)(HAL_CORDIC_STATE_IDLE | HAL_CORDIC_STATE_ACTIVE
                                                     | HAL_CORDIC_STATE_ABORT));

