MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_cordic.c
  p_cordic = CORDIC_GET_INSTANCE(hcordic);

  return ((hal_cordic_scaling_factor_t)LL_CORDIC_GetScale(p_cordic));
}

/**
  * @brief Set the CORDIC argument width.
  * @param  hcordic    Pointer to a \ref hal_cordic_handle_t.
  * @param  input_width The value can be a value of \ref hal_cordic_in_width_t.
  * @retval HAL_OK     Data arguments width was successfully configured.
  */
hal_status_t HAL_CORDIC_SetInputWidth(const hal_cordic_handle_t *hcordic,
                                      const hal_cordic_in_width_t input_width)
{
  CORDIC_TypeDef *p_cordic;

  ASSERT_DBG_PARAM((hcordic != NULL));
  ASSERT_DBG_PARAM(IS_CORDIC_IN_WIDTH(input_width));
  ASSERT_DBG_STATE(hcordic->global_state, (uint32_t)HAL_CORDIC_STATE_IDLE);

  p_cordic = CORDIC_GET_INSTANCE(hcordic);

  LL_CORDIC_SetInWidth(p_cordic, (uint32_t)input_width);

  return HAL_OK;
}

/**
  * @brief Retrieve the CORDIC argument width.
  * @param  hcordic Pointer to a \ref hal_cordic_handle_t.
  * @retval hal_cordic_in_width_t CORDIC argument width.
  */
hal_cordic_in_width_t HAL_CORDIC_GetInputWidth(const hal_cordic_handle_t *hcordic)
{
  CORDIC_TypeDef *p_cordic;

  ASSERT_DBG_PARAM((hcordic != NULL));

  ASSERT_DBG_STATE(hcordic->global_state, (uint32_t)(HAL_CORDIC_STATE_IDLE | HAL_CORDIC_STATE_ACTIVE
                                                     | HAL_CORDIC_STATE_ABORT));

  p_cordic = CORDIC_GET_INSTANCE(hcordic);

  return ((hal_cordic_in_width_t)LL_CORDIC_GetInWidth(p_cordic));
}

/**
  * @brief Set the CORDIC result width.
  * @param  hcordic     Pointer to a \ref hal_cordic_handle_t.
  * @param  output_width The value can be a value of \ref hal_cordic_out_width_t.
  * @retval HAL_OK      Results width was successfully configured.
  */
hal_status_t HAL_CORDIC_SetOutputWidth(const hal_cordic_handle_t *hcordic,
                                       const hal_cordic_out_width_t output_width)
{
  CORDIC_TypeDef *p_cordic;

  ASSERT_DBG_PARAM((hcordic != NULL));
  ASSERT_DBG_PARAM(IS_CORDIC_OUT_WIDTH(output_width));
  ASSERT_DBG_STATE(hcordic->global_state, (uint32_t)HAL_CORDIC_STATE_IDLE);

  p_cordic = CORDIC_GET_INSTANCE(hcordic);

  LL_CORDIC_SetOutWidth(p_cordic, (uint32_t)output_width);

  return HAL_OK;
}

/**
  * @brief Retrieve the CORDIC result width.
  * @param  hcordic Pointer to a \ref hal_cordic_handle_t.
  * @retval hal_cordic_out_width_t CORDIC results width.
  */
hal_cordic_out_width_t HAL_CORDIC_GetOutputWidth(const hal_cordic_handle_t *hcordic)
{
  CORDIC_TypeDef *p_cordic;

  ASSERT_DBG_PARAM((hcordic != NULL));
  ASSERT_DBG_STATE(hcordic->global_state, (uint32_t)(HAL_CORDIC_STATE_IDLE | HAL_CORDIC_STATE_ACTIVE
                                                     | HAL_CORDIC_STATE_ABORT));

  p_cordic = CORDIC_GET_INSTANCE(hcordic);

  return ((hal_cordic_out_width_t)LL_CORDIC_GetOutWidth(p_cordic));
}

/**
  * @brief Set the CORDIC number of arguments expected.
  * @param  hcordic Pointer to a \ref hal_cordic_handle_t.
  * @param  nb_argument The value can be a value of \ref hal_cordic_nb_arg_t.
  * @retval HAL_OK      Number of arguments was successfully configured.
  */
hal_status_t HAL_CORDIC_SetNumberArguments(const hal_cordic_handle_t *hcordic, const hal_cordic_nb_arg_t nb_argument)
{
  CORDIC_TypeDef *p_cordic;

  ASSERT_DBG_PARAM((hcordic != NULL));
  ASSERT_DBG_PARAM(IS_CORDIC_NBARGS(nb_argument));
  ASSERT_DBG_STATE(hcordic->global_state, (uint32_t)HAL_CORDIC_STATE_IDLE);

  p_cordic = CORDIC_GET_INSTANCE(hcordic);

  LL_CORDIC_SetNbWrite(p_cordic, (uint32_t)nb_argument);

  return HAL_OK;
}

/**
  * @brief Retrieve the CORDIC number of arguments.
  * @param  hcordic Pointer to a \ref hal_cordic_handle_t.
  * @retval hal_cordic_nb_arg_t CORDIC number of arguments.
  */
hal_cordic_nb_arg_t HAL_CORDIC_GetNumberArguments(const hal_cordic_handle_t *hcordic)
{
  CORDIC_TypeDef *p_cordic;

  ASSERT_DBG_PARAM((hcordic != NULL));
  ASSERT_DBG_STATE(hcordic->global_state, (uint32_t)(HAL_CORDIC_STATE_IDLE | HAL_CORDIC_STATE_ACTIVE
                                                     | HAL_CORDIC_STATE_ABORT));

  p_cordic = CORDIC_GET_INSTANCE(hcordic);

  return ((hal_cordic_nb_arg_t)LL_CORDIC_GetNbWrite(p_cordic));
}

/**
  * @brief Set the CORDIC number of results expected.
  * @param  hcordic   pointer to a \ref hal_cordic_handle_t.
  * @param  nb_result The value can be a value of \ref hal_cordic_nb_result_t.
  * @retval HAL_OK Number of results was successfully configured.
  */
hal_status_t HAL_CORDIC_SetNumberResults(const hal_cordic_handle_t *hcordic, const hal_cordic_nb_result_t nb_result)
{
  CORDIC_TypeDef *p_cordic;

  ASSERT_DBG_PARAM((hcordic != NULL));
  ASSERT_DBG_PARAM(IS_CORDIC_RESULT_NB(nb_result));
  ASSERT_DBG_STATE(hcordic->global_state, (uint32_t)HAL_CORDIC_STATE_IDLE);

  p_cordic = CORDIC_GET_INSTANCE(hcordic);

  LL_CORDIC_SetNbRead(p_cordic, (uint32_t)nb_result);

  return HAL_OK;
}

/**
  * @brief Retrieve the CORDIC number of results.
  * @param hcordic Pointer to a \ref hal_cordic_handle_t.
  * @retval HAL status.
  */
hal_cordic_nb_result_t HAL_CORDIC_GetNumberResults(const hal_cordic_handle_t *hcordic)
{
  CORDIC_TypeDef *p_cordic;

  ASSERT_DBG_PARAM((hcordic != NULL));
  ASSERT_DBG_STATE(hcordic->global_state, (uint32_t)(HAL_CORDIC_STATE_IDLE | HAL_CORDIC_STATE_ACTIVE
                                                     | HAL_CORDIC_STATE_ABORT));

  p_cordic = CORDIC_GET_INSTANCE(hcordic);

  return ((hal_cordic_nb_result_t)LL_CORDIC_GetNbRead(p_cordic));
}


/**
  * @brief Get the input arguments address.
  *        Arguments can be directly driven by a timer or other peripheral such as an ADC.
  * @param  hcordic Pointer to a \ref hal_cordic_handle_t.
  * @retval input argument address.
  */
volatile uint32_t *HAL_CORDIC_GetWriteAddress(const hal_cordic_handle_t *hcordic)
{
  CORDIC_TypeDef *p_cordic;

  ASSERT_DBG_PARAM((hcordic != NULL));
  ASSERT_DBG_STATE(hcordic->global_state, (uint32_t)(HAL_CORDIC_STATE_IDLE | HAL_CORDIC_STATE_ACTIVE
                                                     | HAL_CORDIC_STATE_ABORT));

