MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_cordic.c
  p_cordic = CORDIC_GET_INSTANCE(hcordic);

  return (uint32_t *)(LL_CORDIC_DMA_GetRegAddr(p_cordic, LL_CORDIC_DMA_REG_DATA_IN));
}

/**
  * @brief Get the output results address.
  *        results can be directly driven by a timer or other peripheral such as a DAC.
  * @param  hcordic Pointer to a \ref hal_cordic_handle_t.
  * @retval the output results address.
  */
volatile uint32_t *HAL_CORDIC_GetReadAddress(const hal_cordic_handle_t *hcordic)
{
  CORDIC_TypeDef *p_cordic;

  ASSERT_DBG_PARAM((hcordic != NULL));
  ASSERT_DBG_STATE(hcordic->global_state, (uint32_t)(HAL_CORDIC_STATE_IDLE | HAL_CORDIC_STATE_ACTIVE
                                                     | HAL_CORDIC_STATE_ABORT));

  p_cordic = CORDIC_GET_INSTANCE(hcordic);

  return (uint32_t *)(LL_CORDIC_DMA_GetRegAddr(p_cordic, LL_CORDIC_DMA_REG_DATA_OUT));
}

#if defined (USE_HAL_CORDIC_DMA) && (USE_HAL_CORDIC_DMA == 1)
/**
  * @brief Set DMA channel for writing arguments.
  * @param  hcordic Pointer to a \ref hal_cordic_handle_t.
  * @param  hdma_wr Pointer to a hal_dma_handle_t structure which contains the DMA instance.
  * @retval HAL_OK            The channel has been correctly set.
  * @retval HAL_INVALID_PARAM hdma_wr is NULL.
  */
hal_status_t HAL_CORDIC_SetWriteDMA(hal_cordic_handle_t *hcordic, hal_dma_handle_t *hdma_wr)
{
  ASSERT_DBG_PARAM(hcordic != NULL);
  ASSERT_DBG_PARAM(hdma_wr != NULL);
  ASSERT_DBG_STATE(hcordic->global_state, HAL_CORDIC_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hdma_wr == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hcordic->p_dma_in = hdma_wr;
  hdma_wr->p_parent = hcordic;

  return HAL_OK;
}

/**
  * @brief Set DMA channel for reading results.
  * @param  hcordic Pointer to a \ref hal_cordic_handle_t.
  * @param  hdma_rd Pointer to a hal_dma_handle_t structure which contains the DMA instance.
  * @retval HAL_OK            The channel has been correctly set.
  * @retval HAL_INVALID_PARAM hdma_rd is NULL.
  */
hal_status_t HAL_CORDIC_SetReadDMA(hal_cordic_handle_t *hcordic, hal_dma_handle_t *hdma_rd)
{
  ASSERT_DBG_PARAM(hcordic != NULL);
  ASSERT_DBG_PARAM(hdma_rd != NULL);
  ASSERT_DBG_STATE(hcordic->global_state, HAL_CORDIC_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hdma_rd == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hcordic->p_dma_out = hdma_rd;
  hdma_rd->p_parent  = hcordic;

  return HAL_OK;
}

#endif /* USE_HAL_CORDIC_DMA */

/**
  * @}
  */


/** @addtogroup CORDIC_Exported_Functions_Group4
  * @{

This section provides a set of functions for the calculation modes of the CORDIC.

There are four calculation modes:
- Blocking mode: Communication is performed in polling mode.
  - HAL_CORDIC_Calculate() : Perform write and read operations in polling mode.
  - HAL_CORDIC_CalculateZeroOverhead() : Perform write and read zero-overhead operations in polling mode.

- Non-blocking mode functions with interrupts are:
  - HAL_CORDIC_Calculate_IT() : Perform write and read operations in IT mode.

- Non-blocking mode functions with DMA are:
  - HAL_CORDIC_Write_DMA() : Write input arguments in DMA mode (the corresponding read stream is handled by another
    peripheral).
  - HAL_CORDIC_Write_DMA_opt() : Write input arguments in DMA mode and optional interrupt (the corresponding read stream
    is handled by another peripheral).
  - HAL_CORDIC_Read_DMA() : Read output results in DMA mode (the corresponding write stream is handled by another
    peripheral).
  - HAL_CORDIC_Read_DMA_opt() : Read output results in DMA mode and optional interrupt (the corresponding read stream is
    handled by another peripheral).
  - HAL_CORDIC_Calculate_DMA() : Perform a write and read operations in DMA mode.

Note that some functions require one or two arguments for the selected calculation function.
The list hereafter summarizes the number of arguments needed by each function of the CORDIC IP driver.
  -  Cosine                 2 arguments
  -  Sine                   2 arguments
  -  Phase                  2 arguments
  -  Modulus                2 arguments
  -  Arctangent             1 argument
  -  Hyperbolic cosine      1 argument
  -  Hyperbolic sine        1 argument
  -  Hyperbolic arctangent  1 argument
  -  natural logarithm      1 argument
  -  Square root            1 argument

Keep in mind that invoking a function that requires two arguments and setting only one argument can generate
erroneous results. To prevent that case, set the unused argument to the default value +1 (0x7FFFFFFF).

Remember that some functions require a scaling factor to produce correct results. Refer to the
reference manual to configure the required parameters correctly for the selected functions.
  */

/**
  * @brief Perform CORDIC processing in polling mode,
  *         according to the existing CORDIC configuration.
  * @param  hcordic    Pointer to a \ref hal_cordic_handle_t.
  * @param  p_in_buff  Pointer to buffer descriptor containing pointer to the input data buffer and the buffer size.
  * @param  p_out_buff Pointer to buffer descriptor containing pointer to the output data buffer and the buffer size.
  * @param  timeout_ms Specify timeout value in milliseconds.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_TIMEOUT       Operation cancelled due to timeout.
  * @retval HAL_BUSY          Concurrent process ongoing.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  */
hal_status_t HAL_CORDIC_Calculate(hal_cordic_handle_t *hcordic, const hal_cordic_buffer_desc_t *p_in_buff,
                                  const hal_cordic_buffer_desc_t *p_out_buff, uint32_t timeout_ms)
{
  CORDIC_TypeDef *p_cordic;
  uint32_t nb_write;
  uint32_t tickstart;
  uint32_t index;
  const int32_t *p_tmp_in_buff;
  int32_t *p_tmp_out_buff;

  ASSERT_DBG_PARAM(hcordic != NULL);
  ASSERT_DBG_PARAM(p_in_buff != NULL);
  ASSERT_DBG_PARAM(p_out_buff != NULL);
  ASSERT_DBG_PARAM(p_in_buff->p_data != NULL);
  ASSERT_DBG_PARAM(p_out_buff->p_data != NULL);
  ASSERT_DBG_PARAM(p_in_buff->size_word > 0UL);
  ASSERT_DBG_PARAM(p_out_buff->size_word > 0UL);
  ASSERT_DBG_STATE(hcordic->global_state, HAL_CORDIC_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_in_buff == NULL) || (p_out_buff == NULL)
      || (p_in_buff->p_data == NULL) || (p_out_buff->p_data == NULL)
      || (p_in_buff->size_word == 0UL) || (p_out_buff->size_word == 0UL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  nb_write = CORDIC_ValidateWriteNumber(hcordic, p_in_buff);

#if defined(USE_ASSERT_DBG_PARAM)
  uint32_t nb_read = CORDIC_ValidateReadNumber(hcordic, p_out_buff);
#endif /* USE_ASSERT_DBG_PARAM */

  ASSERT_DBG_PARAM((nb_write <= nb_read));

  HAL_CHECK_UPDATE_STATE(hcordic, global_state, HAL_CORDIC_STATE_IDLE, HAL_CORDIC_STATE_ACTIVE);

