MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_cordic.c
  p_cordic = CORDIC_GET_INSTANCE(hcordic);

  hcordic->p_wr_arg = CORDIC_WriteDataAndIncPtr_1;
  if (LL_CORDIC_GetNbWrite(p_cordic) == (uint32_t)HAL_CORDIC_NB_ARG_2)
  {
    hcordic->p_wr_arg = CORDIC_WriteDataAndIncPtr_2;
  }

  hcordic->p_rd_result = CORDIC_ReadDataAndIncPtr_1;
  if (LL_CORDIC_GetNbRead(p_cordic) == (uint32_t)HAL_CORDIC_NB_RESULT_2)
  {
    hcordic->p_rd_result = CORDIC_ReadDataAndIncPtr_2;
  }

  p_tmp_in_buff = p_in_buff->p_data;
  p_tmp_out_buff = p_out_buff->p_data;

#if defined(USE_HAL_CORDIC_GET_LAST_ERRORS) && (USE_HAL_CORDIC_GET_LAST_ERRORS == 1)
  hcordic->last_error_codes = HAL_CORDIC_ERROR_NONE;
#endif  /* USE_HAL_CORDIC_GET_LAST_ERRORS */

  /* Init tick_start for timeout management */
  tickstart = HAL_GetTick();

  /* Write of input data in Write Data register, and increment input buffer pointer */
  hcordic->p_wr_arg(hcordic, &p_tmp_in_buff);
  index = (nb_write - 1U);
  /* Calculation is started.
     Provide next set of input data, until number of calculation is achieved */
  do
  {
    /* Write of input data in Write Data register, and increment input buffer pointer */
    hcordic->p_wr_arg(hcordic, &p_tmp_in_buff);
    index--;
    /* Wait for output results to be available */
    do
    {
      if (timeout_ms != HAL_MAX_DELAY)
      {
        if ((HAL_GetTick() - tickstart) > timeout_ms)
        {
          if (LL_CORDIC_IsActiveFlag_RRDY(p_cordic) == CORDIC_FLAG_NOT_ACTIVE)
          {
            hcordic->global_state = HAL_CORDIC_STATE_IDLE;
            return HAL_TIMEOUT;
          }
        }
      }
    } while (LL_CORDIC_IsActiveFlag_RRDY(p_cordic) == CORDIC_FLAG_NOT_ACTIVE);
    /* Read output data from Read Data register, and increment output buffer pointer */
    hcordic->p_rd_result(hcordic, &p_tmp_out_buff);
  } while (index > 0U);

  /* Read output data from Read Data register, and increment output buffer pointer */
  hcordic->p_rd_result(hcordic, &p_tmp_out_buff);

  hcordic->global_state = HAL_CORDIC_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief Perform CORDIC processing in Zero-Overhead mode (output data being read.
  *         soon as input data are written), according to the existing CORDIC configuration.
  * @param  hcordic    Pointer to a \ref hal_cordic_handle_t.
  * @param  p_in_buff  Pointer to buffer descriptor containing pointer to the input data buffer and the buffer size.
  * @param  p_out_buff Pointer to buffer descriptor containing pointer to the output data buffer and the buffer size.
  * @param  timeout_ms Specify timeout value in milliseconds.
  * @retval HAL_OK      Operation completed successfully.
  * @retval HAL_TIMEOUT Operation cancelled due to timeout.
  * @retval HAL_BUSY    Concurrent process ongoing.
  */
hal_status_t HAL_CORDIC_CalculateZeroOverhead(hal_cordic_handle_t *hcordic,
                                              const hal_cordic_buffer_desc_t *p_in_buff,
                                              const hal_cordic_buffer_desc_t *p_out_buff, uint32_t timeout_ms)
{
  const CORDIC_TypeDef *p_cordic;
  const int32_t *p_tmp_in_buff;
  int32_t *p_tmp_out_buff;
  uint32_t nb_write;
  uint32_t tickstart;

  ASSERT_DBG_PARAM((hcordic != NULL));
  ASSERT_DBG_PARAM((p_in_buff != NULL));
  ASSERT_DBG_PARAM((p_out_buff != NULL));
  ASSERT_DBG_PARAM(p_in_buff->p_data != NULL);
  ASSERT_DBG_PARAM(p_out_buff->p_data != NULL);
  ASSERT_DBG_PARAM(p_in_buff->size_word > 0UL);
  ASSERT_DBG_PARAM(p_out_buff->size_word > 0UL);
  ASSERT_DBG_STATE(hcordic->global_state, HAL_CORDIC_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_in_buff == NULL) || (p_out_buff == NULL)
      || (p_in_buff->p_data == NULL) || (p_out_buff->p_data == NULL)
      || (p_in_buff->size_word  == 0UL) || (p_out_buff->size_word  == 0UL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  nb_write = CORDIC_ValidateWriteNumber(hcordic, p_in_buff);
#if defined(USE_ASSERT_DBG_PARAM)
  uint32_t nb_read = CORDIC_ValidateReadNumber(hcordic, p_out_buff);
#endif /* USE_ASSERT_DBG_PARAM */

  ASSERT_DBG_PARAM((nb_write <= nb_read));

  HAL_CHECK_UPDATE_STATE(hcordic, global_state, HAL_CORDIC_STATE_IDLE, HAL_CORDIC_STATE_ACTIVE);

  p_cordic = CORDIC_GET_INSTANCE(hcordic);

  hcordic->p_wr_arg = CORDIC_WriteDataAndIncPtr_1;
  if (LL_CORDIC_GetNbWrite(p_cordic) == (uint32_t)HAL_CORDIC_NB_ARG_2)
  {
    hcordic->p_wr_arg = CORDIC_WriteDataAndIncPtr_2;
  }

  hcordic->p_rd_result = CORDIC_ReadDataAndIncPtr_1;
  if (LL_CORDIC_GetNbRead(p_cordic) == (uint32_t)HAL_CORDIC_NB_RESULT_2)
  {
    hcordic->p_rd_result = CORDIC_ReadDataAndIncPtr_2;
  }

  p_tmp_in_buff  = p_in_buff->p_data;
  p_tmp_out_buff = p_out_buff->p_data;

#if defined(USE_HAL_CORDIC_GET_LAST_ERRORS) && (USE_HAL_CORDIC_GET_LAST_ERRORS == 1)
  hcordic->last_error_codes = HAL_CORDIC_ERROR_NONE;
#endif  /* USE_HAL_CORDIC_GET_LAST_ERRORS */

  /* Init tick_start for timeout management */
  tickstart = HAL_GetTick();

  /* Write of input data in Write Data register, and increment input buffer pointer */
  hcordic->p_wr_arg(hcordic, &p_tmp_in_buff);
  /* Calculation is started. Provide next set of input data, until number of calculation is achieved */
  do
  {
    /* Write of input data in Write Data register, and increment input buffer pointer */
    hcordic->p_wr_arg(hcordic, &p_tmp_in_buff);
    nb_write--;
    /* Read output data from Read Data register, and increment output buffer pointer
       Reading is performed in Zero-Overhead mode: No Result Ready flag, only bus wait insertion. */
    hcordic->p_rd_result(hcordic, &p_tmp_out_buff);

    if (timeout_ms != HAL_MAX_DELAY)
    {
      if ((HAL_GetTick() - tickstart) > timeout_ms)
      {
        if (LL_CORDIC_IsActiveFlag_RRDY(p_cordic) == CORDIC_FLAG_NOT_ACTIVE)
        {
          hcordic->global_state = HAL_CORDIC_STATE_IDLE;
          return HAL_TIMEOUT;
        }
      }
    }
  } while (nb_write > 0U);

  /* Read output data from Read Data register, and increment output buffer pointer.
     The reading is performed in Zero-Overhead mode, reading is done immediately without waiting result ready flag */
  hcordic->p_rd_result(hcordic, &p_tmp_out_buff);

  hcordic->global_state = HAL_CORDIC_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief Perform CORDIC processing in interrupt mode, according to the existing CORDIC configuration.
  * @param  hcordic    Pointer to a \ref hal_cordic_handle_t.
  * @param  p_in_buff  Pointer to buffer descriptor containing pointer to the input data buffer and the buffer size.
  * @param  p_out_buff Pointer to buffer descriptor containing pointer to the output data buffer and the buffer size.
  * @retval HAL_OK   Operation completed successfully.
  * @retval HAL_BUSY Concurrent process ongoing.
  */
hal_status_t HAL_CORDIC_Calculate_IT(hal_cordic_handle_t *hcordic, const hal_cordic_buffer_desc_t *p_in_buff,
                                     const hal_cordic_buffer_desc_t *p_out_buff)
{
  CORDIC_TypeDef *p_cordic;
  const int32_t *tmp_pInBuff;
  uint32_t nb_write;
  uint32_t nb_read;

  ASSERT_DBG_PARAM((hcordic != NULL));
  ASSERT_DBG_PARAM((p_in_buff != NULL));
  ASSERT_DBG_PARAM((p_out_buff != NULL));
  ASSERT_DBG_PARAM(p_in_buff->p_data != NULL);
  ASSERT_DBG_PARAM(p_out_buff->p_data != NULL);
  ASSERT_DBG_PARAM(p_in_buff->size_word > 0UL);
  ASSERT_DBG_PARAM(p_out_buff->size_word > 0UL);
  ASSERT_DBG_STATE(hcordic->global_state, HAL_CORDIC_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_in_buff == NULL) || (p_out_buff == NULL)
      || (p_in_buff->p_data == NULL) || (p_out_buff->p_data == NULL)
      || (p_in_buff->size_word == 0UL) || (p_out_buff->size_word == 0UL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  nb_write = CORDIC_ValidateWriteNumber(hcordic, p_in_buff);
  nb_read = CORDIC_ValidateReadNumber(hcordic, p_out_buff);

  ASSERT_DBG_PARAM((nb_write <= nb_read));

  HAL_CHECK_UPDATE_STATE(hcordic, global_state, HAL_CORDIC_STATE_IDLE, HAL_CORDIC_STATE_ACTIVE);

