MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_cordic.c
  p_cordic = CORDIC_GET_INSTANCE(hcordic);
  tmp_pInBuff = p_in_buff->p_data;

  hcordic->p_wr_arg = CORDIC_WriteDataAndIncPtr_1;
  tmp_pInBuff++;
  if (LL_CORDIC_GetNbWrite(p_cordic) == (uint32_t)HAL_CORDIC_NB_ARG_2)
  {
    hcordic->p_wr_arg = CORDIC_WriteDataAndIncPtr_2;
    tmp_pInBuff++;
  }

  hcordic->p_rd_result = CORDIC_ReadDataAndIncPtr_1;
  if (LL_CORDIC_GetNbRead(p_cordic) == (uint32_t)HAL_CORDIC_NB_RESULT_2)
  {
    hcordic->p_rd_result = CORDIC_ReadDataAndIncPtr_2;
  }

#if defined(USE_HAL_CORDIC_GET_LAST_ERRORS) && (USE_HAL_CORDIC_GET_LAST_ERRORS == 1)
  hcordic->last_error_codes = HAL_CORDIC_ERROR_NONE;
#endif  /* USE_HAL_CORDIC_GET_LAST_ERRORS */

  hcordic->p_input_buffer  = tmp_pInBuff;
  hcordic->p_output_buffer = p_out_buff->p_data;
  hcordic->computation_nb  = nb_write - 1U;
  hcordic->result_nb       = nb_read;

  LL_CORDIC_EnableIT(p_cordic);

  tmp_pInBuff = p_in_buff->p_data;

  /*write of input data in the Write Data register, and increment input buffer pointer */
  hcordic->p_wr_arg(hcordic, &tmp_pInBuff);

  return HAL_OK;
}

#if defined(USE_HAL_CORDIC_DMA) && (USE_HAL_CORDIC_DMA == 1)

/**
  * @brief Write input arguments in DMA mode.
  * @param  hcordic   Pointer to a \ref hal_cordic_handle_t
  * @param  p_in_buff Pointer to buffer descriptor containing pointer to the input data buffer and the buffer size.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_ERROR         Operation completed with error.
  * @retval HAL_BUSY          Concurrent process ongoing.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  */
hal_status_t HAL_CORDIC_Write_DMA(hal_cordic_handle_t *hcordic, const hal_cordic_buffer_desc_t *p_in_buff)
{
  ASSERT_DBG_PARAM((hcordic != NULL));
  ASSERT_DBG_PARAM((p_in_buff != NULL));
  ASSERT_DBG_PARAM(p_in_buff->p_data != NULL);
  ASSERT_DBG_PARAM(p_in_buff->size_word > 0UL);
  ASSERT_DBG_PARAM((hcordic->p_dma_in != NULL));
  ASSERT_DBG_STATE(hcordic->global_state, HAL_CORDIC_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_in_buff == NULL) || (p_in_buff->p_data == NULL)
      || (p_in_buff->size_word == 0UL) || (hcordic->p_dma_in == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hcordic, global_state, HAL_CORDIC_STATE_IDLE, HAL_CORDIC_STATE_ACTIVE);

  /* Enable the DMA stream managing CORDIC input data write */
  if (CORDIC_Write_DMA_opt(hcordic, p_in_buff, (uint32_t)HAL_DMA_OPT_IT_NONE) != HAL_OK)
  {
    hcordic->global_state = HAL_CORDIC_STATE_IDLE;
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief Write input arguments in DMA mode with option. Global state must be IDLE.
  * @param  hcordic   Pointer to a \ref hal_cordic_handle_t.
  * @param  p_in_buff Pointer to input data descriptor: pointer to data and input size in word.
  * @param  opt_it    Optional interruption can be a combination of
  *                   \ref HAL_CORDIC_OPT_DMA_NONE
  *                   \ref HAL_CORDIC_OPT_DMA_IT_HALF_CPLT.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_ERROR         Operation completed with error.
  * @retval HAL_BUSY          Concurrent process ongoing.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  */
hal_status_t HAL_CORDIC_Write_DMA_opt(hal_cordic_handle_t *hcordic, const hal_cordic_buffer_desc_t *p_in_buff,
                                      uint32_t opt_it)
{
  uint32_t interrupt_opt;

  ASSERT_DBG_PARAM((hcordic != NULL));
  ASSERT_DBG_PARAM((p_in_buff != NULL));
  ASSERT_DBG_PARAM(p_in_buff->p_data != NULL);
  ASSERT_DBG_PARAM(p_in_buff->size_word > 0UL);
  ASSERT_DBG_PARAM((hcordic->p_dma_in != NULL));
  ASSERT_DBG_PARAM((IS_CORDIC_OPT_DMA_IT_WR(opt_it)));
  ASSERT_DBG_STATE(hcordic->global_state, HAL_CORDIC_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_in_buff == NULL) || (p_in_buff->p_data == NULL)
      || (p_in_buff->size_word == 0UL) || (opt_it > HAL_CORDIC_OPT_DMA_IT_HALF_CPLT) || (hcordic->p_dma_in == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hcordic, global_state, HAL_CORDIC_STATE_IDLE, HAL_CORDIC_STATE_ACTIVE);

  if ((opt_it & HAL_CORDIC_OPT_DMA_IT_HALF_CPLT) != 0UL)
  {
    interrupt_opt  = HAL_DMA_OPT_IT_HT;
  }
  else
  {
    interrupt_opt  = HAL_DMA_OPT_IT_DEFAULT;
  }

  /* Enable the DMA stream managing CORDIC input data write */
  if (CORDIC_Write_DMA_opt(hcordic, p_in_buff, interrupt_opt) != HAL_OK)
  {
    hcordic->global_state = HAL_CORDIC_STATE_IDLE;
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief Read output results in DMA mode.
  * @param  hcordic    Pointer to a \ref hal_cordic_handle_t.
  * @param  p_out_buff Pointer to buffer descriptor containing pointer to the output data buffer and the buffer size.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_ERROR         Operation completed with error.
  * @retval HAL_BUSY          Concurrent process ongoing.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  */
hal_status_t HAL_CORDIC_Read_DMA(hal_cordic_handle_t *hcordic, hal_cordic_buffer_desc_t *p_out_buff)
{
  ASSERT_DBG_PARAM((hcordic != NULL));
  ASSERT_DBG_PARAM((p_out_buff != NULL));
  ASSERT_DBG_PARAM(p_out_buff->p_data != NULL);
  ASSERT_DBG_PARAM(p_out_buff->size_word > 0UL);
  ASSERT_DBG_PARAM((hcordic->p_dma_out != NULL));
  ASSERT_DBG_STATE(hcordic->global_state, HAL_CORDIC_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_out_buff == NULL) || (p_out_buff->p_data == NULL)
      || (p_out_buff->size_word == 0UL) || (hcordic->p_dma_out == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hcordic, global_state, HAL_CORDIC_STATE_IDLE, HAL_CORDIC_STATE_ACTIVE);

  /* Enable the DMA stream managing CORDIC output data read */
  if (CORDIC_Read_DMA_opt(hcordic, p_out_buff, (uint32_t)HAL_DMA_OPT_IT_NONE) != HAL_OK)
  {
    hcordic->global_state = HAL_CORDIC_STATE_IDLE;
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief Read output result in DMA mode. Global state must be IDLE.
  * @param  hcordic    Pointer to a \ref hal_cordic_handle_t.
  * @param  p_out_buff Pointer to output data descriptor: pointer to data and output size in word.
  * @param  opt_it     Optional interruption can be a combination of the following values:
  *                    @arg \ref HAL_CORDIC_OPT_DMA_NONE
  *                    @arg \ref HAL_CORDIC_OPT_DMA_IT_HALF_CPLT
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_ERROR         Operation completed with error.
  * @retval HAL_BUSY          Concurrent process ongoing.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  */
hal_status_t HAL_CORDIC_Read_DMA_opt(hal_cordic_handle_t *hcordic, hal_cordic_buffer_desc_t *p_out_buff,
                                     uint32_t opt_it)
{
  uint32_t interrupt_opt ;

  ASSERT_DBG_PARAM((hcordic != NULL));
  ASSERT_DBG_PARAM((p_out_buff != NULL));
  ASSERT_DBG_PARAM(p_out_buff->p_data != NULL);
  ASSERT_DBG_PARAM(p_out_buff->size_word > 0UL);
  ASSERT_DBG_PARAM((hcordic->p_dma_out != NULL));
  ASSERT_DBG_PARAM((IS_CORDIC_OPT_DMA_IT_RD(opt_it)));
  ASSERT_DBG_STATE(hcordic->global_state, HAL_CORDIC_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_out_buff == NULL) || (p_out_buff->p_data == NULL)
      || (p_out_buff->size_word == 0UL) || (opt_it > HAL_CORDIC_OPT_DMA_IT_HALF_CPLT) || (hcordic->p_dma_out == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hcordic, global_state, HAL_CORDIC_STATE_IDLE, HAL_CORDIC_STATE_ACTIVE);

