MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_cordic.c
  if ((opt_it & HAL_CORDIC_OPT_DMA_IT_HALF_CPLT) != 0UL)
  {
    interrupt_opt  = HAL_DMA_OPT_IT_HT;
  }
  else
  {
    interrupt_opt  = HAL_DMA_OPT_IT_DEFAULT;
  }

  /* Enable the DMA stream managing CORDIC output data read */
  if (CORDIC_Read_DMA_opt(hcordic, p_out_buff, interrupt_opt) != HAL_OK)
  {
    hcordic->global_state = HAL_CORDIC_STATE_IDLE;
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief Perform  input data and output data of CORDIC processing in DMA mode according to the
  *        existing CORDIC configuration.
  * @param  hcordic    Pointer to a \ref hal_cordic_handle_t.
  * @param  p_in_buff  Pointer to buffer descriptor containing pointer to the input data buffer and the buffer size.
  * @param  p_out_buff Pointer to buffer descriptor containing pointer to the output data buffer and the buffer size.
  * @note   p_in_buff and output_buffer buffers must be 32-bit aligned to ensure a correct DMA transfer to and from
  *         the Peripheral. The function requires to configure the 2 DMA channels (Input and Output).
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_ERROR         Operation error.
  * @retval HAL_BUSY          Concurrent process ongoing.
  */
hal_status_t HAL_CORDIC_Calculate_DMA(hal_cordic_handle_t *hcordic, const hal_cordic_buffer_desc_t *p_in_buff,
                                      hal_cordic_buffer_desc_t *p_out_buff)
{
  ASSERT_DBG_PARAM((hcordic != NULL));
  ASSERT_DBG_PARAM((p_out_buff != NULL));
  ASSERT_DBG_PARAM((p_in_buff != NULL));
  ASSERT_DBG_PARAM(p_in_buff->p_data != NULL);
  ASSERT_DBG_PARAM(p_in_buff->size_word > 0UL);
  ASSERT_DBG_PARAM(p_out_buff->p_data != NULL);
  ASSERT_DBG_PARAM(p_out_buff->size_word > 0UL);
  ASSERT_DBG_PARAM((hcordic->p_dma_in != NULL));
  ASSERT_DBG_PARAM((hcordic->p_dma_out != NULL));
  ASSERT_DBG_STATE(hcordic->global_state, HAL_CORDIC_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_in_buff == NULL) || (p_out_buff == NULL) || (hcordic->p_dma_out == NULL) || (hcordic->p_dma_in == NULL)
      || (p_in_buff->p_data == NULL) || (p_out_buff->p_data == NULL)
      || (p_in_buff->size_word == 0UL) || (p_out_buff->size_word == 0UL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hcordic, global_state, HAL_CORDIC_STATE_IDLE, HAL_CORDIC_STATE_ACTIVE);

  /* Enable the DMA stream managing CORDIC output data read */
  if (CORDIC_Read_DMA_opt(hcordic, p_out_buff, (uint32_t)HAL_DMA_OPT_IT_NONE) != HAL_OK)
  {
    hcordic->global_state = HAL_CORDIC_STATE_IDLE;
    return HAL_ERROR;
  }

  /* Enable the DMA stream managing CORDIC input data write */
  if (CORDIC_Write_DMA_opt(hcordic, p_in_buff, (uint32_t)HAL_DMA_OPT_IT_NONE) != HAL_OK)
  {
    hcordic->global_state = HAL_CORDIC_STATE_IDLE;
    return HAL_ERROR;
  }

  return HAL_OK;
}
#endif /* USE_HAL_CORDIC_DMA */

/**
  * @brief Abort the ongoing transfer (blocking process).
  * @param  hcordic Pointer to a \ref hal_cordic_handle_t.
  * @retval  HAL_OK Operation completed successfully.
  */
hal_status_t HAL_CORDIC_Abort(hal_cordic_handle_t *hcordic)
{
  ASSERT_DBG_PARAM(hcordic != NULL);
  ASSERT_DBG_STATE(hcordic->global_state, HAL_CORDIC_STATE_ACTIVE);

  hcordic->global_state = HAL_CORDIC_STATE_ABORT;

  (void)CORDIC_Abort(hcordic);

  hcordic->global_state = HAL_CORDIC_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief Abort a CORDIC process (non-blocking process).
  * @param  hcordic Pointer to a \ref hal_cordic_handle_t.
  * @retval  HAL_OK Operation completed successfully.
  */
hal_status_t HAL_CORDIC_Abort_IT(hal_cordic_handle_t *hcordic)
{
  CORDIC_TypeDef *p_cordic;
  uint32_t abort_cplt = 1U;

  ASSERT_DBG_PARAM(hcordic != NULL);
  ASSERT_DBG_STATE(hcordic->global_state, HAL_CORDIC_STATE_ACTIVE);

  hcordic->global_state = HAL_CORDIC_STATE_ABORT;

  p_cordic = CORDIC_GET_INSTANCE(hcordic);

#if defined(USE_HAL_CORDIC_DMA) && (USE_HAL_CORDIC_DMA == 1)
  /* Check if the DMA Read (output) is enabled */
  if (LL_CORDIC_IsEnabledDMAReq_RD(p_cordic) != 0U)
  {
    LL_CORDIC_DisableDMAReq_RD(p_cordic);

    if (hcordic->p_dma_out->global_state == HAL_DMA_STATE_ACTIVE)
    {
      hcordic->p_dma_out->p_xfer_abort_cb = CORDIC_DMAAbort;
      if (HAL_DMA_Abort_IT(hcordic->p_dma_out) == HAL_OK)
      {
        abort_cplt = 0U;
      }
    }
  }

  /* Check if the DMA Write (input) is enabled */
  if (LL_CORDIC_IsEnabledDMAReq_WR(p_cordic) != 0U)
  {
    LL_CORDIC_DisableDMAReq_WR(p_cordic);

    if (hcordic->p_dma_in->global_state == HAL_DMA_STATE_ACTIVE)
    {
      hcordic->p_dma_in->p_xfer_abort_cb = CORDIC_DMAAbort;
      if (HAL_DMA_Abort_IT(hcordic->p_dma_in) == HAL_OK)
      {
        abort_cplt = 0U;
      }
    }
  }
#endif /* USE_HAL_CORDIC_DMA */

  /* if no DMA abort complete callback execution is required => call user abort complete callback */
  if (abort_cplt != 0U)
  {
    LL_CORDIC_DisableIT(p_cordic);

    /* Reset the buffers and counters */
    hcordic->p_input_buffer  = NULL;
    hcordic->p_output_buffer = NULL;
    hcordic->computation_nb  = 0UL;
    hcordic->result_nb       = 0UL;
    hcordic->p_wr_arg        = NULL;
    hcordic->p_rd_result     = NULL;

    hcordic->global_state = HAL_CORDIC_STATE_IDLE;

#if defined(USE_HAL_CORDIC_REGISTER_CALLBACKS) && (USE_HAL_CORDIC_REGISTER_CALLBACKS == 1)
    hcordic->p_abort_cplt_cb(hcordic);
#else
    HAL_CORDIC_AbortCpltCallback(hcordic);
#endif /* USE_HAL_CORDIC_REGISTER_CALLBACKS */

#if defined(USE_HAL_CORDIC_GET_LAST_ERRORS) && (USE_HAL_CORDIC_GET_LAST_ERRORS == 1)
    hcordic->last_error_codes = HAL_CORDIC_ERROR_NONE;
#endif /* USE_HAL_CORDIC_GET_LAST_ERRORS */
  }

  return HAL_OK;
}

/**
  * @}
  */

/** @addtogroup CORDIC_Exported_Functions_Group5
  * @{

This section provides functions to:
- Handle the CORDIC interrupt request with HAL_CORDIC_IRQHandler().

There are two ways to use callbacks: override weak callback functions or register user callback functions.
They are used to indicate:
  - When all the computations are done (HAL_CORDIC_CalculateCpltCallback() or callback function registered
    with HAL_CORDIC_RegisterCalculateCpltCallback()).
  - When half of all the computations are read (HAL_CORDIC_ReadHalfCpltCallback() or callback function registered
    with HAL_CORDIC_RegisterReadHalfCpltCallback()).
  - When all the data have been written  (HAL_CORDIC_WriteCpltCallback() or callback function registered
    with HAL_CORDIC_RegisterWriteCpltCallback()).
  - When half of all the data have been written  (HAL_CORDIC_WriteHalfCpltCallback() or callback function registered
    with HAL_CORDIC_RegisterWriteHalfCpltCallback()).
  - When the abort is complete (HAL_CORDIC_AbortCpltCallback() or callback function registered with
    HAL_CORDIC_RegisterAbortCpltCallback()).
  - When an error occurs in the CORDIC driver (HAL_CORDIC_ErrorCallback() or callback function registered with
    HAL_CORDIC_RegisterErrorCallback()).

Depending on the process function you use, different callbacks might be triggered:

| Process API \n \ \n Callbacks    | HAL_CORDIC_Calculate_IT |
|----------------------------------|:-----------------------:|
| HAL_CORDIC_CalculateCpltCallback |            x            |
| HAL_CORDIC_ErrorCallback         |            x            |


| Process API \n \ \n Callbacks    | HAL_CORDIC_Calculate_DMA | HAL_CORDIC_Write_DMA | HAL_CORDIC_Read_DMA |
|----------------------------------|:------------------------:|:--------------------:|:-------------------:|
| HAL_CORDIC_CalculateCpltCallback |            x             |                      |          x          |
| HAL_CORDIC_WriteCpltCallback     |            x             |           x          |                     |
| HAL_CORDIC_ErrorCallback         |            x             |           x          |          x          |


| Process API \n \ \n Callbacks    | HAL_CORDIC_Write_DMA_opt | HAL_CORDIC_Read_DMA_opt |
|----------------------------------|:------------------------:|:-----------------------:|
| HAL_CORDIC_CalculateCpltCallback |                          |             x           |
| HAL_CORDIC_WriteCpltCallback     |             x            |                         |
| HAL_CORDIC_ReadHalfCpltCallback* |                          |             x           |
| HAL_CORDIC_WriteHalfCpltCallback*|             x            |                         |
| HAL_CORDIC_ErrorCallback         |             x            |             x           |

@note with HAL_CORDIC_OPT_DMA_IT_HALF_CPLT argument value for interrupts parameter

