MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_cordic.c
| Process API \n \ \n Callbacks | HAL_CORDIC_Abort_IT |
|-------------------------------|:-------------------:|
| HAL_CORDIC_AbortCpltCallback  |          x          |
  */

/**
  * @brief Handle CORDIC interrupt request.
  * @param  hcordic Pointer to a \ref hal_cordic_handle_t.
  */
void HAL_CORDIC_IRQHandler(hal_cordic_handle_t *hcordic)
{
  CORDIC_TypeDef *p_cordic;

  ASSERT_DBG_PARAM((hcordic != NULL));

  p_cordic = CORDIC_GET_INSTANCE(hcordic);

  /* Check if calculation complete interrupt is enabled and if result ready flag is raised */
  if (LL_CORDIC_IsEnabledIT(p_cordic) != 0U)
  {
    if (LL_CORDIC_IsActiveFlag_RRDY(p_cordic) != CORDIC_FLAG_NOT_ACTIVE)
    {
      hcordic->result_nb--;

      /* Read output data from Read Data register, and increment output buffer pointer */
      hcordic->p_rd_result(hcordic, &(hcordic->p_output_buffer));

      /* Check if calculations are still to be done */
      if (hcordic->computation_nb > 0U)
      {
        hcordic->computation_nb--;
        /* Continue the processing by providing another write of input data
           in the Write Data register, and increment input buffer pointer */
        hcordic->p_wr_arg(hcordic, &(hcordic->p_input_buffer));
      }

      /* Check if all calculations results are all done */
      if (hcordic->result_nb == 0UL)
      {
        LL_CORDIC_DisableIT(p_cordic);
        hcordic->global_state = HAL_CORDIC_STATE_IDLE;

#if defined(USE_HAL_CORDIC_REGISTER_CALLBACKS) && (USE_HAL_CORDIC_REGISTER_CALLBACKS == 1)
        hcordic->p_calculate_cplt_cb(hcordic);
#else
        HAL_CORDIC_CalculateCpltCallback(hcordic);
#endif /* USE_HAL_CORDIC_REGISTER_CALLBACKS */
      }
    }
  }
}

/**
  * @brief CORDIC error callback.
  * @param  hcordic Pointer to a \ref hal_cordic_handle_t.
  * @warning This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__weak void HAL_CORDIC_ErrorCallback(hal_cordic_handle_t *hcordic)
{
  ASSERT_DBG_PARAM(hcordic != NULL);

  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hcordic);
}

/**
  * @brief CORDIC calculate complete callback.
  * @param  hcordic Pointer to a \ref hal_cordic_handle_t.
  * @warning This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__weak void HAL_CORDIC_CalculateCpltCallback(hal_cordic_handle_t *hcordic)
{
  ASSERT_DBG_PARAM(hcordic != NULL);

  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hcordic);
}
#if defined (USE_HAL_CORDIC_DMA) && (USE_HAL_CORDIC_DMA == 1)
/**
  * @brief CORDIC Write data half complete callback.
  * @param  hcordic Pointer to a \ref hal_cordic_handle_t.
  * @warning This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__weak void HAL_CORDIC_WriteHalfCpltCallback(hal_cordic_handle_t *hcordic)
{
  ASSERT_DBG_PARAM(hcordic != NULL);

  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hcordic);
}

/**
  * @brief CORDIC Read data half complete callback.
  * @param  hcordic Pointer to a \ref hal_cordic_handle_t.
  * @warning This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__weak void HAL_CORDIC_ReadHalfCpltCallback(hal_cordic_handle_t *hcordic)
{
  ASSERT_DBG_PARAM(hcordic != NULL);

  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hcordic);
}
#endif /* USE_HAL_CORDIC_DMA */

/**
  * @brief CORDIC Write data complete callback.
  * @param  hcordic Pointer to a \ref hal_cordic_handle_t.
  * @warning This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__weak void HAL_CORDIC_WriteCpltCallback(hal_cordic_handle_t *hcordic)
{
  ASSERT_DBG_PARAM(hcordic != NULL);

  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hcordic);
}

/**
  * @brief Abort completed callback.
  * @param  hcordic Pointer to a \ref hal_cordic_handle_t.
  * @warning This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__weak void HAL_CORDIC_AbortCpltCallback(hal_cordic_handle_t *hcordic)
{
  ASSERT_DBG_PARAM(hcordic != NULL);

  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hcordic);
}

#if defined(USE_HAL_CORDIC_REGISTER_CALLBACKS) && (USE_HAL_CORDIC_REGISTER_CALLBACKS == 1)
/**
  * @brief Register a User CORDIC callback for Error.
  * @param  hcordic    Pointer to a \ref hal_cordic_handle_t.
  * @param  p_callback Pointer to the callback function.
  * @retval  HAL_OK            Register completed successfully.
  * @retval  HAL_INVALID_PARAM p_callback pointer is NULL.
  */
hal_status_t HAL_CORDIC_RegisterErrorCallback(hal_cordic_handle_t *hcordic, hal_cordic_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hcordic != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);
  ASSERT_DBG_STATE(hcordic->global_state, (uint32_t)(HAL_CORDIC_STATE_INIT | HAL_CORDIC_STATE_IDLE));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hcordic->p_error_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief Register a User CORDIC callback for DMA Abort complete.
  * @param  hcordic    Pointer to a \ref hal_cordic_handle_t.
  * @param  p_callback Pointer to the callback function.
  * @retval HAL_OK            Register completed successfully.
  * @retval HAL_INVALID_PARAM p_callback pointer is NULL.
  */
hal_status_t HAL_CORDIC_RegisterAbortCpltCallback(hal_cordic_handle_t *hcordic, hal_cordic_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hcordic != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);
  ASSERT_DBG_STATE(hcordic->global_state, (uint32_t)(HAL_CORDIC_STATE_INIT | HAL_CORDIC_STATE_IDLE));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

