MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_cordic.c
  hcordic->p_abort_cplt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief Register a User CORDIC callback for write data complete.
  * @param  hcordic    Pointer to a \ref hal_cordic_handle_t.
  * @param  p_callback Pointer to the callback function.
  * @retval HAL_OK            Register completed successfully.
  * @retval HAL_INVALID_PARAM p_callback pointer is NULL.
  */
hal_status_t HAL_CORDIC_RegisterWriteCpltCallback(hal_cordic_handle_t *hcordic, hal_cordic_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hcordic != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);
  ASSERT_DBG_STATE(hcordic->global_state, (uint32_t)(HAL_CORDIC_STATE_INIT | HAL_CORDIC_STATE_IDLE));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hcordic->p_write_cplt_cb = p_callback;

  return HAL_OK;
}

#if defined (USE_HAL_CORDIC_DMA) && (USE_HAL_CORDIC_DMA == 1)
/**
  * @brief Register the CORDIC Write Half complete callback.
  * @param  hcordic    Pointer to a \ref hal_cordic_handle_t.
  * @param  p_callback Pointer to the callback function.
  * @retval HAL_OK Register completed successfully.
  */
hal_status_t HAL_CORDIC_RegisterWriteHalfCpltCallback(hal_cordic_handle_t *hcordic, hal_cordic_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hcordic != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);
  ASSERT_DBG_STATE(hcordic->global_state, (uint32_t)(HAL_CORDIC_STATE_INIT | HAL_CORDIC_STATE_IDLE));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hcordic->p_write_half_cplt_cb = p_callback;

  return HAL_OK;
}


/**
  * @brief Register the CORDIC Read Half complete callback.
  * @param  hcordic    Pointer to a \ref hal_cordic_handle_t.
  * @param  p_callback Pointer to the callback function.
  * @retval HAL_OK Register completed successfully.
  */
hal_status_t HAL_CORDIC_RegisterReadHalfCpltCallback(hal_cordic_handle_t *hcordic, hal_cordic_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hcordic != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);
  ASSERT_DBG_STATE(hcordic->global_state, (uint32_t)(HAL_CORDIC_STATE_INIT | HAL_CORDIC_STATE_IDLE));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hcordic->p_read_half_cplt_cb = p_callback;

  return HAL_OK;
}
#endif /* USE_HAL_CORDIC_DMA */

/**
  * @brief Register a User CORDIC callback for calculation complete.
  * @param  hcordic    Pointer to a \ref hal_cordic_handle_t.
  * @param  p_callback Pointer to the callback function.
  * @retval HAL_OK            Register completed successfully.
  * @retval HAL_INVALID_PARAM p_callback pointer is NULL.
  */
hal_status_t HAL_CORDIC_RegisterCalculateCpltCallback(hal_cordic_handle_t *hcordic, hal_cordic_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hcordic != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);
  ASSERT_DBG_STATE(hcordic->global_state, (uint32_t)(HAL_CORDIC_STATE_INIT | HAL_CORDIC_STATE_IDLE));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hcordic->p_calculate_cplt_cb = p_callback;

  return HAL_OK;
}

#endif /* USE_HAL_CORDIC_REGISTER_CALLBACKS */
/**
  * @}
  */

#if defined(USE_HAL_CORDIC_GET_LAST_ERRORS) && (USE_HAL_CORDIC_GET_LAST_ERRORS == 1)
/** @addtogroup CORDIC_Exported_Functions_Group6
  * @{

This section permits retrieving at runtime the last error codes of the CORDIC peripheral with
HAL_CORDIC_GetLastErrorCodes().
  */

/**
  * @brief Return the CORDIC peripheral error.
  * @param  hcordic Pointer to a \ref hal_cordic_handle_t.
  * @retval uint32_t This return value can be a combination of the following values:
  *        @arg \ref HAL_CORDIC_ERROR_NONE
  *        @arg \ref HAL_CORDIC_ERROR_DMA.
  */
uint32_t HAL_CORDIC_GetLastErrorCodes(const hal_cordic_handle_t *hcordic)
{
  ASSERT_DBG_PARAM((hcordic != NULL));

  return hcordic->last_error_codes;
}
/**
  * @}
  */
#endif  /* USE_HAL_CORDIC_GET_LAST_ERRORS */

/** @addtogroup CORDIC_Exported_Functions_Group7
  * @{

This section permits retrieving at runtime the state of the CORDIC peripheral using HAL_CORDIC_GetState().
  */

/**
  * @brief Return the CORDIC handle state.
  * @param  hcordic Pointer to a \ref hal_cordic_handle_t.
  * @retval hal_cordic_state_t CORDIC state.
  */
hal_cordic_state_t HAL_CORDIC_GetState(const hal_cordic_handle_t *hcordic)
{
  ASSERT_DBG_PARAM((hcordic != NULL));

  return hcordic->global_state;
}
/**
  * @}
  */

/** @addtogroup CORDIC_Exported_Functions_Group8
  * @{

This section provides functions to set user-specific data to a CORDIC instance:
    - HAL_CORDIC_SetUserData(): Set user data in handler.
    - HAL_CORDIC_GetUserData(): Get user data from handler.
    - HAL_CORDIC_GetInstance(): Get the HAL CORDIC instance.
    - HAL_CORDIC_GetLLInstance(): Get the hardware CORDIC instance.
  */
#if defined(USE_HAL_CORDIC_USER_DATA) && (USE_HAL_CORDIC_USER_DATA == 1)
/**
  * @brief Store user data pointer into the handle.
  * @param   hcordic     Pointer to a \ref hal_cordic_handle_t.
  * @param   p_user_data Pointer to the user data.
  */
void HAL_CORDIC_SetUserData(hal_cordic_handle_t *hcordic, const void *p_user_data)
{
  ASSERT_DBG_PARAM(hcordic != NULL);

  hcordic->p_user_data = p_user_data;
}

/**
  * @brief Retrieve user data pointer from the handle.
  * @param  hcordic Pointer to a \ref hal_cordic_handle_t.
  * @retval void Pointer to the user data.
  */
const void *HAL_CORDIC_GetUserData(const hal_cordic_handle_t *hcordic)
{
  ASSERT_DBG_PARAM(hcordic != NULL);

  return (hcordic->p_user_data);
}
#endif /* USE_HAL_CORDIC_USER_DATA */

/**
  * @brief  Get the CORDIC instance.
  * @param  hcordic Pointer to a \ref hal_cordic_handle_t structure.
  * @retval HAL_CORDIC HAL CORDIC instance.
  */
hal_cordic_t HAL_CORDIC_GetInstance(const hal_cordic_handle_t *hcordic)
{
  ASSERT_DBG_PARAM(hcordic != NULL);
  ASSERT_DBG_PARAM(IS_CORDIC_ALL_INSTANCE((CORDIC_TypeDef *)((uint32_t)hcordic->instance)));

  return hcordic->instance;
}

/**
  * @brief  Get the hardware CORDIC instance.
  * @param  hcordic Pointer to a \ref hal_cordic_handle_t structure.
  * @retval CORDIC CORDIC peripheral instance.
  */
CORDIC_TypeDef *HAL_CORDIC_GetLLInstance(const hal_cordic_handle_t *hcordic)
{
  ASSERT_DBG_PARAM(hcordic != NULL);
  ASSERT_DBG_PARAM(IS_CORDIC_ALL_INSTANCE((CORDIC_TypeDef *)((uint32_t)hcordic->instance)));

  return ((CORDIC_TypeDef *)((uint32_t)((hcordic)->instance)));
}
/**
  * @}
  */

/**
  * @}
  */    /* CORDIC_Exported_Functions*/

/** @addtogroup CORDIC_Private_Functions
  * @{
  */


/**
  * @brief Calculate and Validate the number of computation to be performed.
  * @param  hcordic              Pointer to a \ref hal_cordic_handle_t.
  * @param  p_input_buffer_desc Pointer to the input buffer descriptor.
  * @note   This function calculates the number of computation using:
  *             - The buffer size
  *             - The computation configuration (number of arguments and size of arguments).
  * @retval  computed_number_write the number of write given the set parameters and the input buffer size.
  */
static uint32_t CORDIC_ValidateWriteNumber(const hal_cordic_handle_t *hcordic,
                                           const hal_cordic_buffer_desc_t *p_input_buffer_desc)
{
  /* number of word per computation given the function configuration */
  /*                   \NARGS |  (1)  |   (2)                     */
  /*            ARG_SIZE \    |   0   |    1                      */
  /*                 -------------------------                    */
  /*         (32-bit)   0     |   1   |    2                      */
  /*                 -------------------------                    */
  /*         (16-bit)   1     |   1   |    1                      */
  /*                 -------------------------                    */

  CORDIC_TypeDef *p_cordic;
  p_cordic = CORDIC_GET_INSTANCE(hcordic);
  /* Extract argument size and number of arguments */
  hal_cordic_in_width_t arg_width = (hal_cordic_in_width_t)LL_CORDIC_GetInWidth(p_cordic);
  hal_cordic_nb_arg_t arg_number = (hal_cordic_nb_arg_t)LL_CORDIC_GetNbWrite(p_cordic);

