MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_cordic.c
  /* Initialize computed_number_write with the size of the input buffer */
  uint32_t computed_number_write = p_input_buffer_desc->size_word;

  /* Adjust computed_number_write based on argument size and number of arguments */
  if ((arg_width == HAL_CORDIC_IN_WIDTH_32_BIT) && (arg_number == HAL_CORDIC_NB_ARG_2))
  {
    computed_number_write >>= 1; /* Equivalent to dividing by 2 */
  }

  return computed_number_write;
}

/**
  * @brief Calculate and Validate the number of computation to read.
  * @param  hcordic              Pointer to a \ref hal_cordic_handle_t.
  * @param  p_output_buffer_desc Pointer to the output buffer descriptor.
  * @note   This function calculates the number of computation using:
  *           - The buffer size
  *           - The computation configuration (number of results and size of results).
  * @retval  computed_number_read the number of results given the set parameters and the output buffer size.
  */
static uint32_t CORDIC_ValidateReadNumber(const hal_cordic_handle_t *hcordic,
                                          const hal_cordic_buffer_desc_t *p_output_buffer_desc)
{
  /* number of word per computation given the function configuration */
  /*                   \NARGS |  (1)  |   (2)                     */
  /*            ARG_SIZE \    |   0   |    1                      */
  /*                 -------------------------                    */
  /*         (32-bit)   0     |   1   |    2                      */
  /*                 -------------------------                    */
  /*         (16-bit)   1     |   1   |    1                      */
  /*                 -------------------------                    */

  CORDIC_TypeDef *p_cordic;
  p_cordic = CORDIC_GET_INSTANCE(hcordic);
  /* Extract result size and number of results */
  hal_cordic_out_width_t res_width  = (hal_cordic_out_width_t)LL_CORDIC_GetOutWidth(p_cordic);
  hal_cordic_nb_result_t res_number = (hal_cordic_nb_result_t)LL_CORDIC_GetNbRead(p_cordic);

  /* Initialize computed_number_read with the size of the output buffer */
  uint32_t computed_number_read = p_output_buffer_desc->size_word;

  /* Adjust computed_number_read based on result size and number of results */
  if ((res_width == HAL_CORDIC_OUT_WIDTH_32_BIT) && (res_number == HAL_CORDIC_NB_RESULT_2))
  {
    computed_number_read >>= 1; /* Equivalent to dividing by 2 */
  }

  return computed_number_read;
}

/**
  * @brief Write blank argument.
  * @param  hcordic Pointer to a \ref hal_cordic_handle_t.
   * @warning   This function has to be called after the calculation is finished in order to avoid an unexpected result
  *         when a 2 arguments function is used with only Arg1 set. Arg2 is set to its default value after reset (+1).
  */
static inline void CORDIC_ResetArguments(const hal_cordic_handle_t *hcordic)
{
  CORDIC_TypeDef *p_cordic;

  p_cordic = CORDIC_GET_INSTANCE(hcordic);

  /* Read the actual configuration */
  hal_cordic_config_t config;

  config.function  = (hal_cordic_function_t)LL_CORDIC_GetFunction(p_cordic);
  config.precision = (hal_cordic_precision_t)LL_CORDIC_GetPrecision(p_cordic);
  config.scaling_factor = (hal_cordic_scaling_factor_t)LL_CORDIC_GetScale(p_cordic);
  config.nb_arg = (hal_cordic_nb_arg_t)LL_CORDIC_GetNbWrite(p_cordic);
  config.nb_result = (hal_cordic_nb_result_t)LL_CORDIC_GetNbRead(p_cordic);
  config.in_width = (hal_cordic_in_width_t)LL_CORDIC_GetInWidth(p_cordic);
  config.out_width = (hal_cordic_out_width_t)LL_CORDIC_GetOutWidth(p_cordic);

  /* Program a Sine function with 2 arguments of 32-bit */
  LL_CORDIC_SetFunction(p_cordic, LL_CORDIC_FUNCTION_SINE);   /* Sine function    */
  LL_CORDIC_SetNbWrite(p_cordic, LL_CORDIC_NBWRITE_2);        /* Two arguments    */
  LL_CORDIC_SetInWidth(p_cordic, LL_CORDIC_INWIDTH_32_BIT);   /* 32-bit arguments */
  LL_CORDIC_SetNbRead(p_cordic, LL_CORDIC_NBREAD_2);          /* Two results      */
  LL_CORDIC_SetOutWidth(p_cordic, LL_CORDIC_OUTWIDTH_32_BIT); /* 32-bit results   */

  /* Write ARG1 - ZeroOverhead mode selected no need to wait until the output results are available.*/
  LL_CORDIC_WriteData(p_cordic, CORDIC_ARGUMENT1);
  /* Write ARG2 - ZeroOverhead mode selected no need to wait until the output results are available.*/
  LL_CORDIC_WriteData(p_cordic, CORDIC_ARGUMENT2);

  /* Read RES1 */
  (void)LL_CORDIC_ReadData(p_cordic);
  /* Read RES2 */
  (void)LL_CORDIC_ReadData(p_cordic);

  /* Set Initial configuration */
  /* Apply all configuration parameters in CORDIC control register */
  LL_CORDIC_Config(p_cordic, (uint32_t)(config.function), (uint32_t)(config.precision),
                   (uint32_t)(config.scaling_factor), (uint32_t)(config.nb_arg),
                   (uint32_t)(config.nb_result), (uint32_t)(config.in_width),
                   (uint32_t)(config.out_width));

}

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
/**
  * @brief Check that the given precision matches the selected function.
  * @param  function  Function to be checked.
  * @param  precision Value of the precision to be set.
  * @warning   This function has to be called in ASSERT_DBG_PARAM() macro inside HAL_CORDIC_SetPrecision() function.
  * @retval 1 The precision parameter matches the function requirements.
  * @retval 0 The precision parameter does not match the function requirements.
  */
static inline uint32_t CORDIC_CheckPrecision(hal_cordic_function_t function, hal_cordic_precision_t precision)
{
  /* Analyse the precision vs the function */
  switch (function)
  {
    case HAL_CORDIC_FUNCTION_SQUARE_ROOT:
      return ((precision >= HAL_CORDIC_PRECISION_1_CYCLE) && (precision <= HAL_CORDIC_PRECISION_3_CYCLE)) ? 1UL : 0UL;
      break;

    case HAL_CORDIC_FUNCTION_COSINE:
    case HAL_CORDIC_FUNCTION_SINE:
    case HAL_CORDIC_FUNCTION_PHASE:
    case HAL_CORDIC_FUNCTION_MODULUS:
    case HAL_CORDIC_FUNCTION_ARCTANGENT:
    case HAL_CORDIC_FUNCTION_HCOSINE:
    case HAL_CORDIC_FUNCTION_HSINE:
    case HAL_CORDIC_FUNCTION_HARCTANGENT:
    case HAL_CORDIC_FUNCTION_NATURAL_LOG:
      return ((precision >= HAL_CORDIC_PRECISION_1_CYCLE) && (precision <= HAL_CORDIC_PRECISION_6_CYCLE)) ? 1UL : 0UL;
      break;

    default:
      return 0UL;
      break;
  }
}

/**
  * @brief Check that the given scaling factor matches the selected function.
  * @param  function        Function to be checked.
  * @param  scaling_factor    Value of the scaling factor to be set.
  * @warning   This function has to be called in ASSERT_DBG_PARAM() macro inside HAL_CORDIC_SetScalingFactor() function.
  * @retval 1 The scaling factor parameter matches the function requirements.
  * @retval 0 The scaling factor parameter does not match the function requirements.
  */
static inline uint32_t CORDIC_CheckScalingFactor(hal_cordic_function_t function,
                                                 hal_cordic_scaling_factor_t scaling_factor)
{
  switch (function)
  {
    case HAL_CORDIC_FUNCTION_COSINE:
    case HAL_CORDIC_FUNCTION_SINE:
    case HAL_CORDIC_FUNCTION_PHASE:
    case HAL_CORDIC_FUNCTION_MODULUS:
      return (scaling_factor == HAL_CORDIC_SCALING_FACTOR_0) ? 1UL : 0UL;
      break;

    case HAL_CORDIC_FUNCTION_ARCTANGENT:
      /* Scale can be any value for arctangent */
      return 1UL;
      break;

