MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_cordic.c
    case HAL_CORDIC_FUNCTION_HCOSINE:
    case HAL_CORDIC_FUNCTION_HSINE:
    case HAL_CORDIC_FUNCTION_HARCTANGENT:
      return (scaling_factor == HAL_CORDIC_SCALING_FACTOR_1) ? 1UL : 0UL;
      break;

    case HAL_CORDIC_FUNCTION_NATURAL_LOG:
      return ((scaling_factor >= HAL_CORDIC_SCALING_FACTOR_1)
              && (scaling_factor <= HAL_CORDIC_SCALING_FACTOR_4)) ? 1UL : 0UL;
      break;

    case HAL_CORDIC_FUNCTION_SQUARE_ROOT:
      return ((scaling_factor > HAL_CORDIC_SCALING_FACTOR_0)
              && (scaling_factor <= HAL_CORDIC_SCALING_FACTOR_2)) ? 1UL : 0UL;
      break;

    default:
      return 0UL;
      break;
  }
}
#endif /* USE_HAL_CHECK_PARAM */

/**
  * @brief Write ARG1 for CORDIC processing, and increment input buffer pointer.
  * @param  hcordic Pointer to a \ref hal_cordic_handle_t.
  * @param  pp_input_buffer Pointer to pointer to input buffer.
  */
static void CORDIC_WriteDataAndIncPtr_1(const hal_cordic_handle_t *hcordic, const int32_t **pp_input_buffer)
{
  CORDIC_TypeDef *p_cordic = CORDIC_GET_INSTANCE(hcordic);

  /* Write input data to the Write Data register and increment the pointer */
  LL_CORDIC_WriteData(p_cordic, (uint32_t) **pp_input_buffer);
  (*pp_input_buffer)++;
}

/**
  * @brief Write ARG1 and ARG2 for CORDIC processing, and increment input buffer pointer.
  * @param  hcordic Pointer to a \ref hal_cordic_handle_t.
  * @param  pp_input_buffer Pointer to pointer to input buffer.
  */
static void CORDIC_WriteDataAndIncPtr_2(const hal_cordic_handle_t *hcordic, const int32_t **pp_input_buffer)
{
  CORDIC_TypeDef *p_cordic = CORDIC_GET_INSTANCE(hcordic);

  /* Write input data to the Write Data register and increment the pointer */
  LL_CORDIC_WriteData(p_cordic, (uint32_t) **pp_input_buffer);
  (*pp_input_buffer)++;

  /* Write the second input data to the Write Data register and increment the pointer */
  LL_CORDIC_WriteData(p_cordic, (uint32_t) **pp_input_buffer);
  (*pp_input_buffer)++;
}

/**
  * @brief Read RES1 of CORDIC processing, and increment output buffer pointer.
  * @param  hcordic          Pointer to a \ref hal_cordic_handle_t.
  * @param  pp_output_buffer Pointer to pointer to output buffer.
  */
static void CORDIC_ReadDataAndIncPtr_1(const hal_cordic_handle_t *hcordic, int32_t **pp_output_buffer)
{
  CORDIC_TypeDef *p_cordic = CORDIC_GET_INSTANCE(hcordic);

  /* Read output data of the Read Data register and increment the pointer */
  **pp_output_buffer = (int32_t)LL_CORDIC_ReadData(p_cordic);
  (*pp_output_buffer)++;
}
/**
  * @brief Read RES1 and RES2 of CORDIC processing, and increment output buffer pointer.
  * @param  hcordic          Pointer to a \ref hal_cordic_handle_t.
  * @param  pp_output_buffer Pointer to pointer to output buffer.
  */
static void CORDIC_ReadDataAndIncPtr_2(const hal_cordic_handle_t *hcordic, int32_t **pp_output_buffer)
{
  CORDIC_TypeDef *p_cordic = CORDIC_GET_INSTANCE(hcordic);

  /* Read output data of the Read Data register and increment the pointer */
  **pp_output_buffer = (int32_t)LL_CORDIC_ReadData(p_cordic);
  (*pp_output_buffer)++;

  /* Read output data of the Read Data register and increment the pointer */
  **pp_output_buffer = (int32_t)LL_CORDIC_ReadData(p_cordic);
  (*pp_output_buffer)++;
}

/**
  * @brief Abort the ongoing transfer (blocking process).
  * @param  hcordic Pointer to a \ref hal_cordic_handle_t.
  * @retval HAL_OK Operation completed successfully.
  */
static hal_status_t CORDIC_Abort(hal_cordic_handle_t *hcordic)
{
  CORDIC_TypeDef *p_cordic;

  p_cordic = CORDIC_GET_INSTANCE(hcordic);

#if defined(USE_HAL_CORDIC_DMA) && (USE_HAL_CORDIC_DMA == 1)
  /* Check if the DMA Read (output) is enabled */
  if (LL_CORDIC_IsEnabledDMAReq_RD(p_cordic) != 0U)
  {
    LL_CORDIC_DisableDMAReq_RD(p_cordic);

    if (hcordic->p_dma_out != NULL)
    {
      (void)HAL_DMA_Abort(hcordic->p_dma_out);

      hcordic->p_output_buffer = NULL;
      hcordic->result_nb = 0U;
    }
  }

  /* Check if the DMA Write (input) is enabled */
  if (LL_CORDIC_IsEnabledDMAReq_WR(p_cordic) != 0U)
  {
    LL_CORDIC_DisableDMAReq_WR(p_cordic);

    if (hcordic->p_dma_in != NULL)
    {
      (void)HAL_DMA_Abort(hcordic->p_dma_in);

      hcordic->p_input_buffer = NULL;
      hcordic->computation_nb = 0U;
    }
  }
#endif /* USE_HAL_CORDIC_DMA */

  hcordic->p_wr_arg        = NULL;
  hcordic->p_rd_result     = NULL;

  LL_CORDIC_DisableIT(p_cordic);
#if defined(USE_HAL_CORDIC_GET_LAST_ERRORS) && (USE_HAL_CORDIC_GET_LAST_ERRORS == 1)
  hcordic->last_error_codes = HAL_CORDIC_ERROR_NONE;
#endif /* USE_HAL_CORDIC_GET_LAST_ERRORS */

  return HAL_OK;
}

#if defined(USE_HAL_CORDIC_DMA) && (USE_HAL_CORDIC_DMA == 1)
/**
  * @brief Write input arguments in DMA mode with option. Global state must be IDLE.
  * @param  hcordic   Pointer to a \ref hal_cordic_handle_t.
  * @param  p_in_buff Pointer to input data descriptor: pointer to data and input size in word.
  * @param  opt_it    Optional interruption can be a combination of
  *                   \ref HAL_CORDIC_OPT_DMA_NONE
  *                   \ref HAL_CORDIC_OPT_DMA_IT_HALF_CPLT.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_ERROR         Operation completed with error.
  */
static hal_status_t CORDIC_Write_DMA_opt(hal_cordic_handle_t *hcordic, const hal_cordic_buffer_desc_t *p_in_buff,
                                         uint32_t opt_it)
{
  CORDIC_TypeDef *p_cordic;
  uint32_t size_input_buffer;
  uint32_t nb_write;

  p_cordic = CORDIC_GET_INSTANCE(hcordic);

  nb_write = CORDIC_ValidateWriteNumber(hcordic, p_in_buff);

  /* Check number of input data expected for each calculation, to retrieve the size of input data buffer */
  size_input_buffer = ((LL_CORDIC_GetNbWrite(p_cordic) == (uint32_t)(HAL_CORDIC_NB_ARG_2))
                       ? (2U * nb_write) : nb_write);

#if defined(USE_HAL_CORDIC_GET_LAST_ERRORS) && (USE_HAL_CORDIC_GET_LAST_ERRORS == 1)
  hcordic->last_error_codes = HAL_CORDIC_ERROR_NONE;
#endif  /* USE_HAL_CORDIC_GET_LAST_ERRORS */

