MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_cordic.c
  /* Prepare DMA write xfer */
  hcordic->p_dma_in->p_xfer_cplt_cb        = CORDIC_DMAInCplt;     /* Set the CORDIC DMA transfer complete callback */
  hcordic->p_dma_in->p_xfer_halfcplt_cb    = CORDIC_DMAInHalfCplt; /* Set the CORDIC DMA transfer half complete cb  */
  hcordic->p_dma_in->p_xfer_error_cb       = CORDIC_DMAError;      /* Set the DMA error callback                    */

  /* Convert the input buffer size into corresponding number of bytes as DMA handles data at byte-level. */
  size_input_buffer = 4U * size_input_buffer;

  if (HAL_DMA_StartPeriphXfer_IT_Opt(hcordic->p_dma_in, (uint32_t)p_in_buff->p_data,
                                     (uint32_t)&p_cordic->WDATA, size_input_buffer, opt_it) != HAL_OK)
  {
#if defined(USE_HAL_CORDIC_GET_LAST_ERRORS) && (USE_HAL_CORDIC_GET_LAST_ERRORS == 1)
    hcordic->last_error_codes |= HAL_CORDIC_ERROR_DMA;
#endif /* USE_HAL_CORDIC_GET_LAST_ERRORS */
    return HAL_ERROR;
  }

  /* Enable DMA Write request*/
  LL_CORDIC_EnableDMAReq_WR(p_cordic);

  return HAL_OK;
}

/**
  * @brief Read output result in DMA mode. Global state must be IDLE.
  * @param  hcordic    Pointer to a \ref hal_cordic_handle_t.
  * @param  p_out_buff Pointer to output data descriptor: pointer to data and output size in word.
  * @param  opt_it     Optional interruption can be a combination of the following values:
  *                    @arg \ref HAL_CORDIC_OPT_DMA_NONE
  *                    @arg \ref HAL_CORDIC_OPT_DMA_IT_HALF_CPLT.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_ERROR         Operation completed with error.
  */
static hal_status_t CORDIC_Read_DMA_opt(hal_cordic_handle_t *hcordic, hal_cordic_buffer_desc_t *p_out_buff,
                                        uint32_t opt_it)
{
  CORDIC_TypeDef *p_cordic;
  uint32_t size_output_buffer;
  uint32_t nb_read;

  p_cordic = CORDIC_GET_INSTANCE(hcordic);

  nb_read = CORDIC_ValidateReadNumber(hcordic, p_out_buff);

  /* Check number of input data expected for each calculation, to retrieve the size of input data buffer */
  size_output_buffer = ((LL_CORDIC_GetNbRead(p_cordic) == (uint32_t)(HAL_CORDIC_NB_RESULT_2))
                        ? (2U * nb_read) : nb_read);

#if defined(USE_HAL_CORDIC_GET_LAST_ERRORS) && (USE_HAL_CORDIC_GET_LAST_ERRORS == 1)
  hcordic->last_error_codes = HAL_CORDIC_ERROR_NONE;

#endif  /* USE_HAL_CORDIC_GET_LAST_ERRORS */
  /* Prepare DMA write xfer */
  hcordic->p_dma_out->p_xfer_cplt_cb        = CORDIC_DMAOutCplt;     /* Set the CORDIC DMA transfer complete callback */
  hcordic->p_dma_out->p_xfer_halfcplt_cb    = CORDIC_DMAOutHalfCplt; /* Set the CORDIC DMA transfer half complete cb  */
  hcordic->p_dma_out->p_xfer_error_cb       = CORDIC_DMAError;       /* Set the DMA error callback                    */

  /* Convert the input buffer size into corresponding number of bytes as DMA handles data at byte-level. */
  size_output_buffer = 4U * size_output_buffer;

  if (HAL_DMA_StartPeriphXfer_IT_Opt(hcordic->p_dma_out, (uint32_t) &(p_cordic->RDATA),
                                     (uint32_t)p_out_buff->p_data, size_output_buffer, opt_it) != HAL_OK)
  {
#if defined(USE_HAL_CORDIC_GET_LAST_ERRORS) && (USE_HAL_CORDIC_GET_LAST_ERRORS == 1)
    hcordic->last_error_codes |= HAL_CORDIC_ERROR_DMA;
#endif /* USE_HAL_CORDIC_GET_LAST_ERRORS */
    return HAL_ERROR;
  }

  /* Enable DMA Read request*/
  LL_CORDIC_EnableDMAReq_RD(p_cordic);

  return HAL_OK;
}

/**
  * @brief DMA CORDIC Input Data process complete callback.
  * @param hdma Pointer to a hal_dma_handle_t.
  */
static void CORDIC_DMAInCplt(hal_dma_handle_t *hdma)
{
  CORDIC_TypeDef *p_cordic;

  hal_cordic_handle_t *hcordic = (hal_cordic_handle_t *)(((hal_dma_handle_t *)hdma)->p_parent);

#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  /* Check if DMA in circular mode*/
  if (hdma->xfer_mode != HAL_DMA_XFER_MODE_LINKEDLIST_CIRCULAR)
#endif /* USE_HAL_DMA_LINKEDLIST */
  {
    hcordic->computation_nb = 0UL;

    p_cordic = CORDIC_GET_INSTANCE(hcordic);

    /* Disable the DMA transfer for input request */
    LL_CORDIC_DisableDMAReq_WR(p_cordic);
  }

#if defined(USE_HAL_CORDIC_REGISTER_CALLBACKS) && (USE_HAL_CORDIC_REGISTER_CALLBACKS == 1)
  hcordic->p_write_cplt_cb(hcordic);
#else
  HAL_CORDIC_WriteCpltCallback(hcordic);
#endif /* USE_HAL_CORDIC_REGISTER_CALLBACKS */
}

/**
  * @brief DMA CORDIC Input Data process half complete callback.
  * @param hdma Pointer to a hal_dma_handle_t.
  */
static void CORDIC_DMAInHalfCplt(hal_dma_handle_t *hdma)
{
  CORDIC_TypeDef *p_cordic;

  hal_cordic_handle_t *hcordic = (hal_cordic_handle_t *)(((hal_dma_handle_t *)hdma)->p_parent);

  p_cordic = CORDIC_GET_INSTANCE(hcordic);

  /* Disable the DMA transfer for input request */
  LL_CORDIC_DisableDMAReq_WR(p_cordic);

#if defined(USE_HAL_CORDIC_REGISTER_CALLBACKS) && (USE_HAL_CORDIC_REGISTER_CALLBACKS == 1)
  hcordic->p_write_half_cplt_cb(hcordic);
#else
  HAL_CORDIC_WriteHalfCpltCallback(hcordic);
#endif /* USE_HAL_CORDIC_REGISTER_CALLBACKS */
}

/**
  * @brief DMA CORDIC Output Data process complete callback.
  * @param hdma Pointer to a hal_dma_handle_t.
  */
static void CORDIC_DMAOutCplt(hal_dma_handle_t *hdma)
{
  CORDIC_TypeDef *p_cordic;

  hal_cordic_handle_t *hcordic = (hal_cordic_handle_t *)(((hal_dma_handle_t *)hdma)->p_parent);

  p_cordic = CORDIC_GET_INSTANCE(hcordic);

#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  /* Check if DMA in circular mode*/
  if (hdma->xfer_mode != HAL_DMA_XFER_MODE_LINKEDLIST_CIRCULAR)
#endif /* USE_HAL_DMA_LINKEDLIST */
  {
    hcordic->result_nb = 0UL;

    hcordic->global_state = HAL_CORDIC_STATE_IDLE;

    /* Disable the DMA transfer for output request */
    LL_CORDIC_DisableDMAReq_RD(p_cordic);

    /* Stop the interrupts error handling */
    LL_CORDIC_DisableIT(p_cordic);
  }

#if defined(USE_HAL_CORDIC_REGISTER_CALLBACKS) && (USE_HAL_CORDIC_REGISTER_CALLBACKS == 1)
  hcordic->p_calculate_cplt_cb(hcordic);
#else
  HAL_CORDIC_CalculateCpltCallback(hcordic);
#endif /* USE_HAL_CORDIC_REGISTER_CALLBACKS */
}

/**
  * @brief DMA CORDIC Output Data read half complete callback.
  * @param hdma Pointer to a hal_dma_handle_t.
  */
static void CORDIC_DMAOutHalfCplt(hal_dma_handle_t *hdma)
{

