MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_cordic.c
  hal_cordic_handle_t *hcordic = (hal_cordic_handle_t *)(((hal_dma_handle_t *)hdma)->p_parent);

#if defined(USE_HAL_CORDIC_REGISTER_CALLBACKS) && (USE_HAL_CORDIC_REGISTER_CALLBACKS == 1)
  hcordic->p_read_half_cplt_cb(hcordic);
#else
  HAL_CORDIC_ReadHalfCpltCallback(hcordic);
#endif /* USE_HAL_CORDIC_REGISTER_CALLBACKS */
}

/**
  * @brief DMA CORDIC communication error callback.
  * @param hdma Pointer to a hal_dma_handle_t.
  */
static void CORDIC_DMAError(hal_dma_handle_t *hdma)
{
  hal_cordic_handle_t *hcordic = (hal_cordic_handle_t *)(((hal_dma_handle_t *)hdma)->p_parent);

  hcordic->global_state = HAL_CORDIC_STATE_IDLE;
#if defined(USE_HAL_CORDIC_GET_LAST_ERRORS) && (USE_HAL_CORDIC_GET_LAST_ERRORS == 1)
  hcordic->last_error_codes |= HAL_CORDIC_ERROR_DMA;
#endif  /* USE_HAL_CORDIC_GET_LAST_ERRORS */

#if defined(USE_HAL_CORDIC_REGISTER_CALLBACKS) && (USE_HAL_CORDIC_REGISTER_CALLBACKS == 1)
  hcordic->p_error_cb(hcordic);
#else
  HAL_CORDIC_ErrorCallback(hcordic);
#endif /* USE_HAL_CORDIC_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA  Abort callback.
  * @param  hdma Pointer to a hal_dma_handle_t structure which contains a DMA instance.
  */
static void CORDIC_DMAAbort(hal_dma_handle_t *hdma)
{
  CORDIC_TypeDef *p_cordic;

  hal_cordic_handle_t *hcordic = (hal_cordic_handle_t *)(((hal_dma_handle_t *)hdma)->p_parent);

  p_cordic = CORDIC_GET_INSTANCE(hcordic);

  /* Disable any DMA requests */
  LL_CORDIC_DisableDMAReq_WR(p_cordic);

  LL_CORDIC_DisableDMAReq_RD(p_cordic);

  /* Disable interrupt */
  LL_CORDIC_DisableIT(p_cordic);

  hcordic->p_input_buffer  = NULL;
  hcordic->p_output_buffer = NULL;
  hcordic->computation_nb = 0U;
  hcordic->result_nb      = 0U;

  hcordic->global_state = HAL_CORDIC_STATE_IDLE;

#if defined(USE_HAL_CORDIC_REGISTER_CALLBACKS) && (USE_HAL_CORDIC_REGISTER_CALLBACKS == 1)
  hcordic->p_abort_cplt_cb(hcordic);
#else
  HAL_CORDIC_AbortCpltCallback(hcordic);
#endif /* USE_HAL_CORDIC_REGISTER_CALLBACKS */
}

#endif /* USE_HAL_CORDIC_DMA */

/**
  * @}
  */

/**
  * @}
  */

#endif /* USE_HAL_CORDIC_MODULE */
#endif /* CORDIC */
/**
  * @}
  */
